IDENTIFICATION DIVISION.
PROGRAM-ID. KAFKAUTILS.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY THREADSAFE.
    COPY NONTHREADSAFE.
    COPY IMMUTABLE.

DATA DIVISION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
    IDENTIFICATION DIVISION.
    PROGRAM-ID. THREADSAFE.
        COPY THREADSAFE.
    END PROGRAM THREADSAFE.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. NONTHREADSAFE.
        COPY NONTHREADSAFE.
    END PROGRAM NONTHREADSAFE.

    IDENTIFICATION DIVISION.
    PROGRAM-ID. IMMUTABLE.
        COPY IMMUTABLE.
    END PROGRAM IMMUTABLE.