IDENTIFICATION DIVISION.
PROGRAM-ID. KAFKAUTILSIMPLICITS.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "JAVA-UTIL-PROPERTIES.cpy".
    COPY "JAVA-UTIL-HASHTABLE.cpy".
    COPY "SCALA-JDKCOLLECTIONCONVERTERS.cpy".

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 PROPERTIES-OPS.
      05 PROPERTIES PIC X(10) VALUE "PROPERTIES".
      05 FILLER PIC X(5) VALUE "++=(". 
      05 PROPS PIC X(6) VALUE "PROPS)".
      05 FILLER PIC X(5) VALUE "UNIT".
      05 FILLER PIC X(1) VALUE ".".
      05 FILLER PIC X(5) VALUE "++=(". 
      05 MAP PIC X(3) VALUE "MAP)".
      05 FILLER PIC X(5) VALUE "UNIT".
      05 FILLER PIC X(1) VALUE ".".

PROCEDURE DIVISION.

MAIN-PROCEDURE.
    INVOKE "JAVA-UTIL-PROPERTIES" "PUTALL" USING PROPERTIES PROPS.
    INVOKE "JAVA-UTIL-HASHTABLE" "PUTALL" USING PROPERTIES MAP.
    STOP RUN.