IDENTIFICATION DIVISION.
PROGRAM-ID. MX4JLOADER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "KAFKA-UTILS-LOGGING.COB".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PROPS PIC X(20) VALUE "VERIFIABLE-PROPERTIES".
01 ADDRESS PIC X(11) VALUE "MX4JADDRESS".
01 PORT PIC 9(4) VALUE 8082.
01 PROCESS-NAME PIC X(20) VALUE "PROCESSOR-NAME".
01 HTTP-ADAPTOR-CLASS PIC X(20) VALUE "HTTP-ADAPTOR-CLASS".
01 HTTP-ADAPTOR PIC X(20) VALUE "HTTP-ADAPTOR".
01 HTTP-NAME PIC X(15) VALUE "SYSTEM:NAME=HTTP".
01 XSLT-PROCESSOR-CLASS PIC X(20) VALUE "XSLT-PROCESSOR-CLASS".
01 XSLT-PROCESSOR PIC X(20) VALUE "XSLT-PROCESSOR".

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    CALL "MAYBE-LOAD" USING RETURN-CODE.
    IF RETURN-CODE = 0
        DISPLAY "FAILED TO LOAD MX4J"
    ELSE
        DISPLAY "MX4J SUCCESSFULLY LOADED"
    END-IF.
    STOP RUN.

MAYBE-LOAD.
    CALL "VERIFIABLE-PROPERTIES" USING SYSTEM-PROPERTIES, PROPS.
    IF PROPS-BOOLEAN("KAFKA-MX4JENABLE", FALSE)
        MOVE PROPS-STRING(ADDRESS, "0.0.0.0") TO ADDRESS
        MOVE PROPS-INT(PORT, 8082) TO PORT
        PERFORM TRY-LOAD
    END-IF.
    MOVE 0 TO RETURN-CODE.

TRY-LOAD.
    PERFORM DEBUG "WILL TRY TO LOAD MX4J NOW, IF IT'S IN THE CLASSPATH".
    CALL "GET-PLATFORM-MBEAN-SERVER" USING MBS.
    MOVE "SERVER:NAME=XSLTPROCESSOR" TO PROCESS-NAME.
    CALL "LOAD-CLASS" USING HTTP-ADAPTOR-CLASS, HTTP-ADAPTOR.
    CALL "INVOKE-METHOD" USING HTTP-ADAPTOR, "SETHOST", ADDRESS.
    CALL "INVOKE-METHOD" USING HTTP-ADAPTOR, "SETPORT", PORT.
    MOVE "SYSTEM:NAME=HTTP" TO HTTP-NAME.
    CALL "REGISTER-MBEAN" USING MBS, HTTP-ADAPTOR, HTTP-NAME.
    CALL "LOAD-CLASS" USING XSLT-PROCESSOR-CLASS, XSLT-PROCESSOR.
    CALL "INVOKE-METHOD" USING HTTP-ADAPTOR, "SETPROCESSOR", XSLT-PROCESSOR.
    CALL "REGISTER-MBEAN" USING MBS, XSLT-PROCESSOR, PROCESS-NAME.
    CALL "INVOKE-METHOD" USING HTTP-ADAPTOR, "START".
    PERFORM INFO "MX4J SUCCESSFULLY LOADED".
    MOVE 1 TO RETURN-CODE.

HANDLE-EXCEPTIONS.
    EVALUATE TRUE
        WHEN EXCEPTION-CLASS-NOT-FOUND
            PERFORM INFO "WILL NOT LOAD MX4J, MX4J-TOOLS.JAR IS NOT IN THE CLASSPATH"
        WHEN OTHER
            PERFORM WARN "COULD NOT START REGISTER MBEAN IN JMX" USING EXCEPTION-OBJECT
    END-EVALUATE.