IDENTIFICATION DIVISION.
PROGRAM-ID. VERIFIABLE-PROPERTIES.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "KAFKA-UTILS".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PROPS USAGE IS OBJECT REFERENCE.
01 REFERENCE-SET USAGE IS OBJECT REFERENCE.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM INIT-VERIFIABLE-PROPERTIES.
    PERFORM VERIFY-PROPERTIES.
    STOP RUN.

INIT-VERIFIABLE-PROPERTIES.
    MOVE NEW PROPERTIES TO PROPS.
    MOVE NEW MUTABLE-HASH-SET TO REFERENCE-SET.

VERIFY-PROPERTIES.
    PERFORM DISPLAY-INFO "Verifying properties".
    PERFORM VARYING PROP-NAME THROUGH PROPERTIES-LIST
        IF NOT REFERENCE-SET CONTAINS PROP-NAME
            AND PROP-NAME NOT STARTS-WITH "external"
            THEN PERFORM DISPLAY-WARN "Property %s is not valid" PROP-NAME
            ELSE PERFORM DISPLAY-INFO "Property %s is overridden to %s" PROP-NAME PROPS:GET-PROPERTY(PROP-NAME)
        END-IF
    END-PERFORM.

PROPERTIES-LIST.
    MOVE PROPS:PROPERTY-NAMES TO PROPERTY-NAMES.
    MOVE PROPERTY-NAMES TO PROPERTY-NAMES-SORTED.

DISPLAY-INFO.
    PERFORM LOGGING USING INFORMATION MESSAGE.

DISPLAY-WARN.
    PERFORM LOGGING USING WARNING MESSAGE.

LOGGING.
    PERFORM LOGGING-SERVICE USING MESSAGE.