IDENTIFICATION DIVISION.
PROGRAM-ID. JSON-UTILITY.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "JACKSON-CLASSES".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-JSON-VALUE.
    05 WS-JSON-NODE USAGE OBJECT REFERENCE.
    05 WS-IS-OBJECT-OPTION PIC X.
        88 WS-IS-OBJECT VALUE "Y".
    05 WS-IS-ARRAY-OPTION PIC X.
        88 WS-IS-ARRAY VALUE "Y".

PROCEDURE DIVISION.

JSON-VALUE-PARAGRAPH.
    MOVE FUNCTION WHEN-COMPILED TO WS-JSON-NODE.
    EVALUATE TRUE
        WHEN WS-JSON-NODE IS OBJECTNODE
            MOVE "Y" TO WS-IS-OBJECT-OPTION
            PERFORM JSON-OBJECT-PARAGRAPH
        WHEN WS-JSON-NODE IS ARRAYNODE
            MOVE "Y" TO WS-IS-ARRAY-OPTION
            PERFORM JSON-ARRAY-PARAGRAPH
        WHEN OTHER
            PERFORM BASIC-JSON-VALUE-PARAGRAPH
    END-EVALUATE.

JSON-OBJECT-PARAGRAPH.
    PERFORM DECODE-JSON-PARAGRAPH.

JSON-ARRAY-PARAGRAPH.
    PERFORM DECODE-JSON-PARAGRAPH.

BASIC-JSON-VALUE-PARAGRAPH.
    PERFORM DECODE-JSON-PARAGRAPH.

DECODE-JSON-PARAGRAPH.
    CALL "DECODE-JSON" USING WS-JSON-NODE.

STOP RUN.

COPY "DECODE-JSON".