IDENTIFICATION DIVISION.
PROGRAM-ID. BROKER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "KAFKA-COMMON.CPY".
    COPY "KAFKA-NODE.CPY".
    COPY "KAFKA-SECURITY-PROTOCOL.CPY".
    COPY "KAFKA-LISTENER-NAME.CPY".
    COPY "KAFKA-BROKER-END-POINT.CPY".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BROKER-ID PIC 9(10).
01 BROKER-END-POINTS OCCURS 1 TO 9999 DEPENDING ON END-POINTS-COUNT.
   05 BROKER-HOST PIC X(100).
   05 BROKER-PORT PIC 9(5).
   05 BROKER-LISTENER-NAME PIC X(100).
   05 BROKER-SECURITY-PROTOCOL PIC X(100).
01 BROKER-RACK PIC X(100).
01 BROKER-SUPPORTED-FEATURES PIC X(1000).
01 END-POINTS-COUNT PIC 9(5).

PROCEDURE DIVISION.
BROKER-INIT.
    MOVE ID TO BROKER-ID.
    MOVE ENDPOINTS TO BROKER-END-POINTS.
    MOVE RACK TO BROKER-RACK.
    MOVE FEATURES TO BROKER-SUPPORTED-FEATURES.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > END-POINTS-COUNT
        MOVE BROKER-HOST(I) TO BROKER-END-POINT-HOST(I)
        MOVE BROKER-PORT(I) TO BROKER-END-POINT-PORT(I)
        MOVE BROKER-LISTENER-NAME(I) TO BROKER-END-POINT-LISTENER-NAME(I)
        MOVE BROKER-SECURITY-PROTOCOL(I) TO BROKER-END-POINT-SECURITY-PROTOCOL(I)
    END-PERFORM.

    IF END-POINTS-COUNT <> COUNT(BROKER-END-POINTS)
        RAISE ILLEGAL-ARGUMENT-EXCEPTION
            WITH MESSAGE "There is more than one end point with the same listener name"
    END-IF.

BROKER-TO-STRING.
    STRING
        BROKER-ID, " : ",
        PERFORM VARYING I FROM 1 BY 1 UNTIL I > END-POINTS-COUNT
            BROKER-END-POINT-HOST(I), ":", BROKER-END-POINT-PORT(I), ",",
        END-PERFORM, " : ",
        BROKER-RACK, " : ",
        BROKER-SUPPORTED-FEATURES
    INTO BROKER-STRING
    .

BROKER-NODE.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > END-POINTS-COUNT
        IF BROKER-LISTENER-NAME(I) = LISTENER-NAME
            MOVE BROKER-ID TO BROKER-NODE-ID
            MOVE BROKER-END-POINT-HOST(I) TO BROKER-NODE-HOST
            MOVE BROKER-END-POINT-PORT(I) TO BROKER-NODE-PORT
            MOVE BROKER-RACK TO BROKER-NODE-RACK
            EXIT PARAGRAPH
        END-IF
    END-PERFORM.
    RAISE BROKER-END-POINT-NOT-AVAILABLE-EXCEPTION
        WITH MESSAGE "End point with listener name " LISTENER-NAME-VALUE " not found for broker " BROKER-ID.

BROKER-END-POINT.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > END-POINTS-COUNT
        IF BROKER-LISTENER-NAME(I) = LISTENER-NAME
            MOVE BROKER-ID TO BROKER-END-POINT-ID
            MOVE BROKER-END-POINT-HOST(I) TO BROKER-END-POINT-HOST
            MOVE BROKER-END-POINT-PORT(I) TO BROKER-END-POINT-PORT
            EXIT PARAGRAPH
        END-IF
    END-PERFORM.
    RAISE BROKER-END-POINT-NOT-AVAILABLE-EXCEPTION
        WITH MESSAGE "End point with listener name " LISTENER-NAME-VALUE " not found for broker " BROKER-ID.

BROKER-END-POINT-BY-NAME.
    MOVE ENDPOINTS-MAP(LISTENER-NAME) TO ENDPOINT.
    IF ENDPOINT IS NULL
        RAISE BROKER-END-POINT-NOT-AVAILABLE-EXCEPTION
            WITH MESSAGE "End point with listener name " LISTENER-NAME-VALUE " not found for broker " BROKER-ID
    END-IF.

BROKER-CTOR-1.
    MOVE ID TO BROKER-ID.
    MOVE ENDPOINT TO BROKER-END-POINTS(1).
    MOVE RACK TO BROKER-RACK.
    MOVE EMPTY-SUPPORTED-FEATURES TO BROKER-SUPPORTED-FEATURES.
    MOVE 1 TO END-POINTS-COUNT.

BROKER-CTOR-2.
    MOVE ID TO BROKER-ID.
    MOVE ENDPOINTS TO BROKER-END-POINTS.
    MOVE RACK TO BROKER-RACK.
    MOVE EMPTY-SUPPORTED-FEATURES TO BROKER-SUPPORTED-FEATURES.
    MOVE COUNT(ENDPOINTS) TO END-POINTS-COUNT.

STOP RUN.