IDENTIFICATION DIVISION.
PROGRAM-ID. REPLICA-MANAGEMENT.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY KAFKA-COMMON.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 REPLICA-STATE.
   05 LOG-START-OFFSET      PIC 9(18) COMP-3.
   05 LOG-END-OFFSET-META.
      10 MESSAGE-OFFSET     PIC 9(18) COMP-3.
      10 OTHER-META         PIC X(100).
   05 LAST-FETCH-LEADER-LOG-END-OFFSET PIC 9(18) COMP-3.
   05 LAST-FETCH-TIME-MS    PIC 9(18) COMP-3.
   05 LAST-CAUGHT-UP-TIME-MS PIC 9(18) COMP-3.
   05 BROKER-EPOCH          PIC 9(18) COMP-3.

PROCEDURE DIVISION.

REPLICA-UPDATE-FETCH-STATE.
    MOVE FUNCTION MAX(LAST-CAUGHT-UP-TIME-MS, FOLLOWER-FETCH-TIME-MS) TO LAST-CAUGHT-UP-TIME-MS.
    MOVE FOLLOWER-FETCH-OFFSET-METADATA TO LOG-END-OFFSET-META.
    MOVE FOLLOWER-START-OFFSET TO LOG-START-OFFSET.
    MOVE FUNCTION MAX(LEADER-END-OFFSET, LAST-FETCH-LEADER-LOG-END-OFFSET) TO LAST-FETCH-LEADER-LOG-END-OFFSET.
    MOVE FOLLOWER-FETCH-TIME-MS TO LAST-FETCH-TIME-MS.
    MOVE BROKER-EPOCH TO BROKER-EPOCH.

REPLICA-RESET-STATE.
    IF IS-NEW-LEADER
        MOVE ZERO TO LOG-START-OFFSET
        MOVE ZERO TO MESSAGE-OFFSET OF LOG-END-OFFSET-META
        MOVE ZERO TO LAST-FETCH-LEADER-LOG-END-OFFSET
        MOVE ZERO TO LAST-FETCH-TIME-MS
        MOVE CURRENT-TIME-MS TO LAST-CAUGHT-UP-TIME-MS
        MOVE ZERO TO BROKER-EPOCH
    ELSE
        MOVE CURRENT-REPLICA-STATE-LOG-START-OFFSET TO LOG-START-OFFSET
        MOVE CURRENT-REPLICA-STATE-LOG-END-OFFSET-META TO LOG-END-OFFSET-META
        MOVE LEADER-END-OFFSET TO LAST-FETCH-LEADER-LOG-END-OFFSET
        IF IS-FOLLOWER-IN-SYNC
            MOVE CURRENT-TIME-MS TO LAST-FETCH-TIME-MS
        ELSE
            MOVE ZERO TO LAST-FETCH-TIME-MS
        END-IF
        MOVE FUNCTION MAX(CURRENT-TIME-MS, CURRENT-REPLICA-STATE-LAST-CAUGHT-UP-TIME-MS) TO LAST-CAUGHT-UP-TIME-MS
        MOVE CURRENT-REPLICA-STATE-BROKER-EPOCH TO BROKER-EPOCH
    END-IF.