IDENTIFICATION DIVISION.
PROGRAM-ID. LOG4J-CONFIGURATION.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "JACKSON-ANNOTATIONS.cpy".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOG4J-CONFIGURATION.
    02 CONFIGURATION.
        03 PROPERTIES.
            04 PROPERTIES-MAP OCCURS 1 TO 9999 TIMES DEPENDING ON PROPERTIES-COUNT.
                05 PROPERTIES-KEY PIC X(1) TO X(32).
                05 PROPERTIES-VALUE PIC X(1) TO X(128).
        03 APPENDERS.
            04 APPENDERS-MAP OCCURS 1 TO 9999 TIMES DEPENDING ON APPENDERS-COUNT.
                05 APPENDERS-KEY PIC X(1) TO X(32).
                05 APPENDERS-VALUE PIC X(1) TO X(128).
        03 LOGGERS.
            04 ROOT.
                05 ROOT-LEVEL PIC X(1) TO X(16).
                05 ROOT-OTHER-PROPERTIES OCCURS 1 TO 9999 TIMES DEPENDING ON ROOT-OTHER-PROPERTIES-COUNT.
                    06 ROOT-OTHER-PROPERTIES-KEY PIC X(1) TO X(32).
                    06 ROOT-OTHER-PROPERTIES-VALUE PIC X(1) TO X(128).
            04 LOGGER-TABLE OCCURS 1 TO 9999 TIMES DEPENDING ON LOGGER-COUNT.
                05 LOGGER-NAME PIC X(1) TO X(32).
                05 LOGGER-LEVEL PIC X(1) TO X(16).
                05 LOGGER-OTHER-PROPERTIES OCCURS 1 TO 9999 TIMES DEPENDING ON LOGGER-OTHER-PROPERTIES-COUNT.
                    06 LOGGER-OTHER-PROPERTIES-KEY PIC X(1) TO X(32).
                    06 LOGGER-OTHER-PROPERTIES-VALUE PIC X(1) TO X(128).
        03 ADDITIONAL-PROPERTIES OCCURS 1 TO 9999 TIMES DEPENDING ON ADDITIONAL-PROPERTIES-COUNT.
            04 ADDITIONAL-PROPERTIES-KEY PIC X(1) TO X(32).
            04 ADDITIONAL-PROPERTIES-VALUE PIC X(1) TO X(128).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    MOVE CONFIGURATION TO CONFIGURATION OF LOG4J-CONFIGURATION.