IDENTIFICATION DIVISION.
PROGRAM-ID. DEFAULT-EXTERNAL-KRAFT-METRICS.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL INTRINSIC.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-BROKER-SERVER-METRICS PIC X(30) VALUE SPACE.
01 WS-CONTROLLER-METADATA-METRICS PIC X(30) VALUE SPACE.

LINKAGE SECTION.
01 LNK-BROKER-SERVER-METRICS USAGE POINTER.
01 LNK-CONTROLLER-METADATA-METRICS USAGE POINTER.

PROCEDURE DIVISION USING LNK-BROKER-SERVER-METRICS LNK-CONTROLLER-METADATA-METRICS.

    MOVE LNK-BROKER-SERVER-METRICS TO WS-BROKER-SERVER-METRICS.
    MOVE LNK-CONTROLLER-METADATA-METRICS TO WS-CONTROLLER-METADATA-METRICS.

    PERFORM SET-IGNORED-STATIC-VOTERS.

    STOP RUN.

SET-IGNORED-STATIC-VOTERS SECTION.
    IF WS-BROKER-SERVER-METRICS NOT = SPACE
        CALL "SET-IGNORED-STATIC-VOTERS" USING WS-BROKER-SERVER-METRICS
    END-IF.
    
    IF WS-CONTROLLER-METADATA-METRICS NOT = SPACE
        CALL "SET-IGNORED-STATIC-VOTERS" USING WS-CONTROLLER-METADATA-METRICS
    END-IF.

    EXIT.