IDENTIFICATION DIVISION.
PROGRAM-ID. COORDINATORPARTITIONWRITER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY KAFKARECORD.
    COPY TOPICPARTITION.
    COPY LOGCONFIG.
    COPY VERIFICATIONGUARD.
    COPY ACTIONQUEUE.
    COPY REQUESTLOCAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DIRECTACTIONQUEUE PIC X(30) VALUE "DIRECTACTIONQUEUE".
01 REPLICAMANAGER PIC X(30).
01 APPENDERROR PIC X(30) VALUE "APPENDRECORDSERROR".
01 DELETERECORDSERROR PIC X(30) VALUE "DELETERECORDSERROR".
01 NOTLEADERORFOLLOW PIC X(30) VALUE "NOTLEADERORFOLLOW".

PROCEDURE DIVISION.
REGISTERLISTENER.
    ACCEPT TP FROM TOPICPARTITION.
    ACCEPT LISTENER FROM PARTITIONWRITER-LISTENER.
    CALL "REPLICAMANAGER" USING TP, NEW LISTENERADAPTER(LISTENER).

DEREGISTERLISTENER.
    ACCEPT TP FROM TOPICPARTITION. 
    ACCEPT LISTENER FROM PARTITIONWRITER-LISTENER.
    CALL "REPLICAMANAGER" USING TP, NEW LISTENERADAPTER(LISTENER) GIVING RETURN-CODE.

CONFIG.
    ACCEPT TP FROM TOPICPARTITION.
    CALL "REPLICAMANAGER" USING TP GIVING LOGCONFIG.
    IF LOGCONFIG IS EQUAL TO SPACES
        RAISE NOTLEADERORFOLLOW-EXCEPTION.
    RETURN LOGCONFIG.

MAYBESTARTVERIFICATION.
    ACCEPT TP FROM TOPICPARTITION.
    ACCEPT TRANSACTIONALID PIC X(50) FROM PROCEDURE-PARAMETER.
    ACCEPT PRODUCERID PIC 9(18) FROM PROCEDURE-PARAMETER. 
    ACCEPT PRODUCEREPOCH PIC 9(4) FROM PROCEDURE-PARAMETER.
    ACCEPT APIVERSION PIC 9(4) FROM PROCEDURE-PARAMETER.
    CALL "REPLICAMANAGER" USING TP, TRANSACTIONALID, PRODUCERID, PRODUCEREPOCH, APIVERSION GIVING VERIFICATIONGUARD.
    RETURN VERIFICATIONGUARD.

APPEND.
    ACCEPT TP FROM TOPICPARTITION.
    ACCEPT VERIFICATIONGUARD FROM PROCEDURE-PARAMETER.
    ACCEPT RECORDS FROM MEMORYRECORDS.
    CALL "REPLICAMANAGER" USING TP, VERIFICATIONGUARD, RECORDS GIVING APPENDRESULTS.
    IF APPENDRESULTS(TP) IS EQUAL TO SPACES OR APPENDRESULTS(TP)."ERROR-CODE" IS NOT EQUAL TO ZEROES
        RAISE APPENDERROR-EXCEPTION.
    COMPUTE REQUIREDOFFSET = APPENDRESULTS(TP)."LAST-OFFSET" + 1.
    RETURN REQUIREDOFFSET.

DELETERECORDS.
    ACCEPT TP FROM TOPICPARTITION. 
    ACCEPT DELETEBEFOREOFFSET PIC 9(18) FROM PROCEDURE-PARAMETER.
    CALL "REPLICAMANAGER" USING TP, DELETEBEFOREOFFSET GIVING DELETERESULTS.
    IF DELETERESULTS."ERROR-CODE" IS NOT EQUAL TO ZEROES
        RAISE DELETERECORDSERROR-EXCEPTION.
    RETURN NULL.

STOP RUN.