IDENTIFICATION DIVISION.
PROGRAM-ID. REQUEST-CHANNEL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
COPY "KAFKA-COMMON.cpy".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 REQUEST-QUEUE PIC X(32767) VALUE SPACE.
01 CALLBACK-QUEUE PIC X(32767) VALUE SPACE.
01 PROCESSORS PIC X(32767) VALUE SPACE.
01 REQUEST-QUEUE-SIZE-METRIC-NAME PIC X(32767) VALUE SPACE.
01 RESPONSE-QUEUE-SIZE-METRIC-NAME PIC X(32767) VALUE SPACE.
01 PROCESSOR-METRIC-TAG PIC X(32767) VALUE SPACE.

PROCEDURE DIVISION.

SEND-REQUEST.
    MOVE REQUEST-CHANNEL-REQUEST TO REQUEST-QUEUE.

CLOSE-CONNECTION.
    PERFORM UPDATE-ERROR-METRICS.
    PERFORM SEND-RESPONSE.

SEND-RESPONSE.
    PERFORM UPDATE-ERROR-METRICS.
    MOVE REQUEST-CHANNEL-SEND-RESPONSE TO CALLBACK-QUEUE.
    MOVE REQUEST-CHANNEL-WAKEUP-REQUEST TO REQUEST-QUEUE.

SEND-NO-OP-RESPONSE.
    MOVE REQUEST-CHANNEL-NO-OP-RESPONSE TO CALLBACK-QUEUE.
    MOVE REQUEST-CHANNEL-WAKEUP-REQUEST TO REQUEST-QUEUE.

START-THROTTLING.
    MOVE REQUEST-CHANNEL-START-THROTTLING-RESPONSE TO CALLBACK-QUEUE.
    MOVE REQUEST-CHANNEL-WAKEUP-REQUEST TO REQUEST-QUEUE.

END-THROTTLING.
    MOVE REQUEST-CHANNEL-END-THROTTLING-RESPONSE TO CALLBACK-QUEUE.
    MOVE REQUEST-CHANNEL-WAKEUP-REQUEST TO REQUEST-QUEUE.

RECEIVE-REQUEST.
    MOVE CALLBACK-QUEUE TO TEMP-REQUEST.
    IF TEMP-REQUEST IS NOT EQUAL TO SPACE
        RETURN TEMP-REQUEST
    ELSE
        MOVE REQUEST-QUEUE TO TEMP-REQUEST
        IF TEMP-REQUEST IS EQUAL TO REQUEST-CHANNEL-WAKEUP-REQUEST
            MOVE CALLBACK-QUEUE TO TEMP-REQUEST
        RETURN TEMP-REQUEST.

UPDATE-ERROR-METRICS.
    PERFORM VARYING ERROR-IDX FROM 1 BY 1 UNTIL ERROR-IDX > ERROR-COUNT
        MOVE ERROR-COUNTS(ERROR-IDX) TO METRIC-ERROR-COUNT
        MOVE ERRORS(ERROR-IDX) TO METRIC-ERROR
        MOVE APIKEY-NAME TO METRIC-NAME
        PERFORM UPDATE-METRIC
    END-PERFORM.

UPDATE-METRIC.
    MOVE METRIC-NAME TO METRIC(METRIC-NAME).
    MOVE METRIC-ERROR TO METRIC(METRIC-ERROR).
    MOVE METRIC-ERROR-COUNT TO METRIC(METRIC-ERROR-COUNT).
    PERFORM METRIC-UPDATE.

CLEAR.
    MOVE SPACE TO REQUEST-QUEUE.
    MOVE SPACE TO CALLBACK-QUEUE.

SHUTDOWN.
    PERFORM CLEAR.
    PERFORM METRIC-CLOSE.

SEND-SHUTDOWN-REQUEST.
    MOVE REQUEST-CHANNEL-SHUTDOWN-REQUEST TO REQUEST-QUEUE.

SEND-CALLBACK-REQUEST.
    MOVE CALLBACK-REQUEST TO CALLBACK-QUEUE.
    MOVE REQUEST-CHANNEL-WAKEUP-REQUEST TO REQUEST-QUEUE.

PROCEDURE DIVISION.

STOP RUN.