IDENTIFICATION DIVISION.
PROGRAM-ID. CLIENT-REQUEST-QUOTA-MANAGER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL INTRINSIC FUNCTIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NANOS-TO-PERCENTAGE-PER-SECOND PIC 9V9(2) COMP-1 VALUE 100.0 / FUNCTION SECONDS-TO-NANOSECONDS(1).
01 WS-DEFAULT-INACTIVE-EXEMPT-SENSOR-EXPIRATION-TIME-SECONDS PIC 9(18) COMP-1 VALUE FUNCTION LONG-MAX().
01 WS-EXEMPT-SENSOR-NAME PIC X(15) VALUE "exempt-REQUEST".

LINKAGE SECTION.
01 LNK-REQUEST.
   05 LNK-REQUEST-SESSION PIC X(20).
   05 LNK-REQUEST-CLIENT-ID PIC X(50).
   05 LNK-REQUEST-THREAD-TIME-NANOS PIC 9(18) COMP-1.
01 LNK-TIME-MS PIC 9(10) COMP-1.
01 LNK-THROTTLE-TIME-MS PIC 9(10) COMP-1.

PROCEDURE DIVISION USING LNK-REQUEST, LNK-TIME-MS, LNK-THROTTLE-TIME-MS.

    PERFORM MAYBE-RECORD-AND-GET-THROTTLE-TIME-MS.
    PERFORM MAYBE-RECORD-EXEMPT.
    MOVE LNK-THROTTLE-TIME-MS TO RETURN-CODE.
    GOBACK.

MAYBE-RECORD-AND-GET-THROTTLE-TIME-MS SECTION.
    IF QUOTAS-ENABLED
        MOVE LNK-REQUEST-THREAD-TIME-NANOS TO WS-TEMP
        PERFORM RECORD-NO-THROTTLE
        MOVE 0 TO LNK-THROTTLE-TIME-MS
    ELSE
        MOVE 0 TO LNK-THROTTLE-TIME-MS.

RECORD-NO-THROTTLE SECTION.
    PERFORM RECORD-AND-GET-THROTTLE-TIME-MS
    MOVE LNK-THROTTLE-TIME-MS TO RETURN-CODE.

RECORD-AND-GET-THROTTLE-TIME-MS SECTION.
    PERFORM RECORD-EXEMPT.
    MOVE 0 TO LNK-THROTTLE-TIME-MS.

RECORD-EXEMPT SECTION.
    CALL "RECORD-EXEMPT" USING WS-NANOS-TO-PERCENTAGE-PER-SECOND, LNK-REQUEST-THREAD-TIME-NANOS.

MAYBE-RECORD-EXEMPT SECTION.
    IF QUOTAS-ENABLED
        MOVE LNK-REQUEST-THREAD-TIME-NANOS TO WS-TEMP
        PERFORM RECORD-EXEMPT.

QUOTAS-ENABLED SECTION.
    RETURN 1.

END PROGRAM CLIENT-REQUEST-QUOTA-MANAGER.