IDENTIFICATION DIVISION.
PROGRAM-ID. DYNAMIC-CONFIG.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY KAFKA-CONFIG.
    COPY QUOTA-CONFIG.
    COPY GROUP-CONFIG.
    COPY CLIENT-METRICS-CONFIG.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BROKER-CONFIGS.
   05 BROKER-QUOTA-CONFIGS.
      COPY QUOTA-CONFIG-DEFINITIONS.
   05 OTHER-DYNAMIC-CONFIGS.
      COPY KAFKA-CONFIG-DEFINITIONS.
01 CLIENT-CONFIGS.
   COPY QUOTA-CONFIG-DEFINITIONS.
01 USER-CONFIGS.
   COPY QUOTA-CONFIG-DEFINITIONS.
   COPY SCRAM-MECHANISM-CONFIGS.
01 IP-CONFIGS.
   COPY QUOTA-CONFIG-DEFINITIONS.
01 CLIENT-METRICS-CONFIGS.
   COPY CLIENT-METRICS-CONFIG-DEFINITIONS.
01 GROUP-CONFIGS.
   COPY GROUP-CONFIG-DEFINITIONS.
01 PROPS USAGE IS PROPERTIES.
01 RESOLVED-PROPS USAGE IS PROPERTIES.
01 NAMES-SET USAGE IS PROCEDURE-POINTER.
01 KEYS-SET USAGE IS PROCEDURE-POINTER.
01 VALIDATE-PROPS USAGE IS PROCEDURE-POINTER.

PROCEDURE DIVISION.

BROKER-CONFIG SECTION.
    MOVE QUOTA-CONFIG-BROKER-QUOTA-CONFIGS TO BROKER-QUOTA-CONFIGS.
    MOVE KAFKA-CONFIG-KEYS TO OTHER-DYNAMIC-CONFIGS.
    MOVE BROKER-QUOTA-CONFIGS TO BROKER-CONFIGS.
    MOVE BROKER-CONFIGS-NAMES TO NAMES-SET.
    MOVE BROKER-CONFIGS-KEYS TO KEYS-SET.
    MOVE BROKER-CONFIGS-VALIDATE TO VALIDATE-PROPS.

CLIENT-CONFIG SECTION.
    MOVE QUOTA-CONFIG-USER-AND-CLIENT-QUOTA-CONFIGS TO CLIENT-CONFIGS.
    MOVE CLIENT-CONFIGS-KEYS TO KEYS-SET.
    MOVE CLIENT-CONFIGS-NAMES TO NAMES-SET.
    MOVE CLIENT-CONFIGS-VALIDATE TO VALIDATE-PROPS.

USER-CONFIG SECTION. 
    MOVE QUOTA-CONFIG-SCRAM-MECHANISMS-PLUS-USER-AND-CLIENT-QUOTA-CONFIGS TO USER-CONFIGS.
    MOVE USER-CONFIGS-KEYS TO KEYS-SET.
    MOVE USER-CONFIGS-NAMES TO NAMES-SET.
    MOVE USER-CONFIGS-VALIDATE TO VALIDATE-PROPS.

IP-CONFIG SECTION.
    MOVE QUOTA-CONFIG-IP-CONFIGS TO IP-CONFIGS.
    MOVE IP-CONFIGS-KEYS TO KEYS-SET.
    MOVE IP-CONFIGS-NAMES TO NAMES-SET.
    MOVE IP-CONFIGS-VALIDATE TO VALIDATE-PROPS.

CLIENT-METRICS-CONFIG SECTION.
    MOVE CLIENT-METRICS-CONFIG-DEFINITIONS TO CLIENT-METRICS-CONFIGS.
    MOVE CLIENT-METRICS-CONFIGS-NAMES TO NAMES-SET.

GROUP-CONFIG SECTION.
    MOVE GROUP-CONFIG-DEFINITIONS TO GROUP-CONFIGS.
    MOVE GROUP-CONFIGS-NAMES TO NAMES-SET.

VALIDATE SECTION.
    PERFORM VALIDATE-PROPS USING PROPS, RESOLVED-PROPS, CUSTOMPROPSALLOWED.

STOP RUN.