IDENTIFICATION DIVISION.
PROGRAM-ID. DYNAMIC-BROKER-CONFIG.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL-DYNAMIC-CONFIGS IS EXTERNAL.
    FUNCTION BROKER-CONFIG-SYNONYMS IS EXTERNAL.
    FUNCTION VALIDATE-CONFIGS IS EXTERNAL.
    FUNCTION DYNAMIC-CONFIG-UPDATE-MODES IS EXTERNAL.
    FUNCTION RESOLVE-VARIABLE-CONFIGS IS EXTERNAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 STATIC-BROKER-CONFIGS PIC X(1024) VALUE SPACE.
01 STATIC-DEFAULT-CONFIGS PIC X(1024) VALUE SPACE.
01 DYNAMIC-BROKER-CONFIGS PIC X(1024) VALUE SPACE.
01 DYNAMIC-DEFAULT-CONFIGS PIC X(1024) VALUE SPACE.
01 RECONFIGURABLES PIC X(1024) VALUE SPACE.
01 BROKER-RECONFIGURABLES PIC X(1024) VALUE SPACE.
01 LOCK PIC X(1024) VALUE SPACE.
01 METRICS-RECEIVER-PLUGIN-OPT PIC X(1024) VALUE SPACE.
01 CURRENT-CONFIG PIC X(1024) VALUE SPACE.

PROCEDURE DIVISION.

INITIALIZE-METHOD.
    MOVE KAFKACONFIG-PROPS TO CURRENT-CONFIG.
    MOVE CLIENT-METRICS-RECEIVER-PLUGIN-OPT TO METRICS-RECEIVER-PLUGIN-OPT.

CLEAR-METHOD.
    MOVE SPACE TO DYNAMIC-BROKER-CONFIGS.
    MOVE SPACE TO DYNAMIC-DEFAULT-CONFIGS.
    MOVE SPACE TO RECONFIGURABLES.
    MOVE SPACE TO BROKER-RECONFIGURABLES.

ADD-RECONFIGURABLES-METHOD.
    CALL "AUTHORIZER" USING KAFKASERVER
        IF RETURN-CODE IS GREATER THAN ZERO
            CALL "ADD-RECONFIGURABLE" USING AUTHORIZER.
    CALL "ADD-RECONFIGURABLE" USING KAFKASERVER-KAFKAYAMMERMETRICS.
    CALL "ADD-RECONFIGURABLE" USING DYNAMIC-METRICS-REPORTERS.
    CALL "ADD-RECONFIGURABLE" USING DYNAMIC-CLIENT-QUOTA-CALLBACK.

    CALL "ADD-BROKER-RECONFIGURABLE" USING BROKER-DYNAMIC-THREAD-POOL.
    CALL "ADD-BROKER-RECONFIGURABLE" USING DYNAMIC-LOG-CONFIG.
    CALL "ADD-BROKER-RECONFIGURABLE" USING DYNAMIC-LISTENER-CONFIG.
    CALL "ADD-BROKER-RECONFIGURABLE" USING KAFKASERVER-SOCKETSSERVER.
    CALL "ADD-BROKER-RECONFIGURABLE" USING DYNAMIC-PRODUCER-STATE-MANAGER-CONFIG.
    CALL "ADD-BROKER-RECONFIGURABLE" USING DYNAMIC-REMOTE-LOG-CONFIG.

ADD-CONTROLLER-RECONFIGURABLES-METHOD.
    CALL "AUTHORIZER" USING CONTROLLER
        IF RETURN-CODE IS GREATER THAN ZERO
            CALL "ADD-RECONFIGURABLE" USING AUTHORIZER.
    IF KAFKACONFIG-PROCESS-ROLES NOT CONTAINS BROKER-ROLE
        CALL "ADD-RECONFIGURABLE" USING CONTROLLER-KAFKAYAMMERMETRICS.
        CALL "ADD-RECONFIGURABLE" USING DYNAMIC-METRICS-REPORTERS.
    END-IF.
    CALL "ADD-RECONFIGURABLE" USING DYNAMIC-CLIENT-QUOTA-CALLBACK.
    CALL "ADD-BROKER-RECONFIGURABLE" USING CONTROLLER-DYNAMIC-THREAD-POOL.
    CALL "ADD-BROKER-RECONFIGURABLE" USING CONTROLLER-SOCKETSSERVER.

UPDATE-BROKER-CONFIG-METHOD.
    MOVE PERSISTENT-PROPS TO PROPS.
    CALL "VALIDATE-CONFIGS" USING PROPS TRUE.
    MOVE PROPS TO DYNAMIC-BROKER-CONFIGS.
    CALL "UPDATE-CURRENT-CONFIG" USING FALSE.

UPDATE-DEFAULT-CONFIG-METHOD.
    MOVE PERSISTENT-PROPS TO PROPS.
    CALL "VALIDATE-CONFIGS" USING PROPS FALSE.
    MOVE PROPS TO DYNAMIC-DEFAULT-CONFIGS. 
    CALL "UPDATE-CURRENT-CONFIG" USING FALSE.

RELOAD-UPDATED-FILES-METHOD.
    CALL "VALIDATED-KAFKA-PROPS" USING PROPS TRUE GIVING NEWPROPS.
    CALL "PROCESS-RECONFIGURATION" USING NEWPROPS TRUE FALSE.

VALIDATED-KAFKA-PROPS-METHOD.
    CALL "RESOLVE-VARIABLE-CONFIGS" USING PROPS GIVING RESOLVED-PROPS.
    CALL "VALIDATE-CONFIGS" USING RESOLVED-PROPS PROPS-PER-BROKER.
    MOVE STATIC-BROKER-CONFIGS TO NEWPROPS.
    IF PROPS-PER-BROKER
        CALL "OVERRIDE-PROPS" USING NEWPROPS DYNAMIC-DEFAULT-CONFIGS.
        CALL "OVERRIDE-PROPS" USING NEWPROPS RESOLVED-PROPS.
    ELSE
        CALL "OVERRIDE-PROPS" USING NEWPROPS RESOLVED-PROPS.
        CALL "OVERRIDE-PROPS" USING NEWPROPS DYNAMIC-BROKER-CONFIGS.
    END-IF.
    RETURN NEWPROPS.

VALIDATE-METHOD.
    CALL "VALIDATED-KAFKA-PROPS" USING PROPS PROPS-PER-BROKER GIVING NEWPROPS.
    CALL "PROCESS-RECONFIGURATION" USING NEWPROPS TRUE.

PROCESS-RECONFIGURATION-METHOD.
    CALL "CREATE-KAFKA-CONFIG" USING NEWPROPS GIVING NEWCONFIG.
    CALL "UPDATE-CONFIGS" USING NEWCONFIG OLDCONFIG GIVING CHANGEDCONFIGS DELETEDKEYS.
    PERFORM VARYING RECONFIGURABLE IN RECONFIGURABLES
        CALL "MAYBE-RECONFIGURE" USING RECONFIGURABLE OLDCONFIG NEWCONFIG
    END-PERFORM.
    PERFORM VARYING BROKER-RECONFIGURABLE IN BROKER-RECONFIGURABLES
        IF NEEDS-RECONFIGURATION(BROKER-RECONFIGURABLE-CONFIGS, CHANGEDCONFIGS, DELETEDKEYS)
            CALL "VALIDATE-RECONFIGURATION" USING BROKER-RECONFIGURABLE NEWCONFIG
            IF RETURN-CODE IS ZERO
                MOVE BROKER-RECONFIGURABLE TO BROKER-RECONFIGURABLES-TO-UPDATE
        END-IF
    END-PERFORM.
    RETURN NEWCONFIG, BROKER-RECONFIGURABLES-TO-UPDATE.

OVERRIDE-PROPS-METHOD.
    PERFORM VARYING KEY IN PROPSOVERRIDE
        CALL "BROKER-CONFIG-SYNONYMS" USING KEY FALSE
            VARYING SYNONYM IN SYNONYMS
                CALL "REMOVE" USING PROPS SYNONYM
        END-PERFORM
        MOVE PROPSOVERRIDE(KEY) TO PROPS(KEY)
    END-PERFORM.

NEEDS-RECONFIGURATION-METHOD.
    INITIALIZE NEEDS-RECONFIGURATION TO FALSE.
    PERFORM VARYING CONFIG IN RECONFIGURABLE-CONFIGS
        IF CONFIG IN UPDATED-KEYS OR CONFIG IN DELETED-KEYS
            MOVE TRUE TO NEEDS-RECONFIGURATION
            EXIT PARAGRAPH
        END-IF
    END-PERFORM.

PROCESS-LISTENER-RECONFIGURABLE-METHOD.
    CALL "VALIDATED-KAFKA-PROPS" USING NEWPROPS TRUE GIVING LISTENER-NEWPROPS.
    CALL "UPDATE-CONFIGS" USING LISTENER-NEWPROPS OLDLISTENER-NEWPROPS
        GIVING LISTENER-CHANGEDCONFIGS LISTENER-DELETEDKEYS.
    CALL "PROCESS-RECONFIGURABLE" USING LISTENER-RECONFIGURABLE
        LISTENER-CHANGEDCONFIGS LISTENER-NEWPROPS CUSTOMCONFIGS
        VALIDATEONLY.
    IF NOT VALIDATEONLY AND NOT RELOADONLY
        CALL "PROCESS-RECONFIGURABLE" USING LISTENER-RECONFIGURABLE
            LISTENER-CHANGEDCONFIGS LISTENER-NEWPROPS CUSTOMCONFIGS.
    END-IF.

PROCESS-RECONFIGURABLE-METHOD.
    CALL "VALIDATE-RECONFIGURATION" USING RECONFIGURABLE NEWCONFIGS.
    IF RETURN-CODE IS ZERO
        CALL "RECONFIGURE" USING RECONFIGURABLE OLDCONFIGS NEWCONFIGS.
    END-IF.

UPDATE-CURRENT-CONFIG-METHOD.
    MOVE STATIC-BROKER-CONFIGS TO NEWPROPS.
    CALL "OVERRIDE-PROPS" USING NEWPROPS DYNAMIC-DEFAULT-CONFIGS.
    CALL "OVERRIDE-PROPS" USING NEWPROPS DYNAMIC-BROKER-CONFIGS.
    CALL "CREATE-KAFKA-CONFIG" USING NEWPROPS GIVING NEWCONFIG.
    CALL "UPDATE-CONFIGS" USING NEWCONFIG CURRENTCONFIG
        GIVING CHANGEDCONFIGS DELETEDKEYS.
    MOVE NEWCONFIG TO CURRENTCONFIG.
    CALL "KAFKACONFIG-UPDATE-CURRENT-CONFIG" USING NEWCONFIG.
    PERFORM VARYING BROKER-RECONFIGURABLE IN BROKER-RECONFIGURABLES-TO-UPDATE
        CALL "RECONFIGURE" USING BROKER-RECONFIGURABLE OLDCONFIG NEWCONFIG
    END-PERFORM.

BROKER-RECONFIGURABLE SECTION.
    RECONFIGURABLE-CONFIGS.
        MOVE ALL-DYNAMIC-CONFIGS TO RECONFIGURABLE-CONFIGS.

    VALIDATE-RECONFIGURATION-METHOD.
        PERFORM VARYING CONFIG IN RECONFIGURABLE-CONFIGS
            EVALUATE CONFIG
                WHEN LOG-ROLL-TIME-MILLIS-CONFIG OR LOG-ROLL-TIME-HOURS-CONFIG
                    PERFORM LOG-ROLL-TIME-VALIDATION
                WHEN LOG-ROLL-TIME-JITTER-MILLIS-CONFIG OR LOG-ROLL-TIME-JITTER-HOURS-CONFIG
                    PERFORM LOG-ROLL-TIME-JITTER-VALIDATION
                WHEN LOG-FLUSH-INTERVAL-MS-CONFIG
                    PERFORM LOG-FLUSH-INTERVAL-VALIDATION
                WHEN LOG-RETENTION-TIME-MILLIS-CONFIG OR LOG-RETENTION-TIME-MINUTES-CONFIG OR LOG-RETENTION-TIME-HOURS-CONFIG
                    PERFORM LOG-RETENTION-TIME-VALIDATION
                WHEN OTHER
                    CONTINUE
            END-EVALUATE
        END-PERFORM.

    LOG-ROLL-TIME-VALIDATION.
        IF NEWCONFIG-LOG-ROLL-TIME-MILLIS NOT = OLDCONFIG-LOG-ROLL-TIME-MILLIS
            RAISE CONFIGEXCEPTION.

    LOG-ROLL-TIME-JITTER-VALIDATION.
        IF NEWCONFIG-LOG-ROLL-TIME-JITTER-MILLIS NOT = OLDCONFIG-LOG-ROLL-TIME-JITTER-MILLIS
            RAISE CONFIGEXCEPTION.

    LOG-FLUSH-INTERVAL-VALIDATION.
        IF NEWCONFIG-LOG-FLUSH-INTERVAL-MS NOT = OLDCONFIG-LOG-FLUSH-INTERVAL-MS
            RAISE CONFIGEXCEPTION.

    LOG-RETENTION-TIME-VALIDATION.
        IF NEWCONFIG-LOG-RETENTION-TIME-MILLIS NOT = OLDCONFIG-LOG-RETENTION-TIME-MILLIS
            RAISE CONFIGEXCEPTION.

    RECONFIGURE-METHOD.
        CALL "RECONFIGURE-DEFAULT-LOG-CONFIG" USING NEWBROKERDEFAULTS.
        CALL "UPDATE-LOGS-CONFIG" USING NEWBROKERDEFAULTS.

DYNAMIC-METRICS-REPORTERS SECTION.
    CONFIGURE-METHOD.
        MOVE SPACE TO PROPS.

    RECONFIGURABLE-CONFIGS-METHOD.
        MOVE METRIC-REPORTER-CLASSES-CONFIG TO CONFIGS.
        PERFORM VARYING REPORTER IN CURRENTREPORTERS
            IF REPORTER IS RECONFIGURABLE
                MOVE REPORTER-RECONFIGURABLE-CONFIGS TO CONFIGS
            END-IF
        END-PERFORM.
        RETURN CONFIGS.

    VALIDATE-RECONFIGURATION-METHOD.
        PERFORM VARYING REPORTERCLASS IN UPDATED-METRICS-REPORTERS
            CALL "LOAD-CLASS" USING REPORTERCLASS GIVING CLAZZ.
        END-PERFORM.
        PERFORM VARYING REPORTER IN CURRENTREPORTERS
            IF UPDATED-METRICS-REPORTERS CONTAINS REPORTER-CLASS-NAME
                CALL "VALIDATE-RECONFIGURATION" USING REPORTER NEWCONFIGS
            END-IF
        END-PERFORM.

    RECONFIGURE-METHOD.
        PERFORM VARYING REPORTERCLASS IN UPDATED-METRICS-REPORTERS
            CALL "CREATE-REPORTER" USING REPORTERCLASS NEWCONFIGS GIVING REPORTER.
            MOVE REPORTER TO CURRENTREPORTERS(REPORTERCLASS).
        END-PERFORM.
        PERFORM VARYING REPORTER IN CURRENTREPORTERS
            IF REPORTER IS RECONFIGURABLE
                CALL "MAYBE-RECONFIGURE" USING REPORTER OLDCONFIG NEWCONFIGS
            END-IF
        END-PERFORM.
        PERFORM VARYING DELETEDREPORTER IN DELETED-REPORTERS
            CALL "REMOVE-REPORTER" USING DELETEDREPORTER
        END-PERFORM.

DYNAMIC-CLIENT-QUOTA-CALLBACK SECTION.
    CONFIGURE-METHOD.
        MOVE SPACE TO PROPS.

    RECONFIGURABLE-CONFIGS-METHOD.
        MOVE SPACE TO CONFIGS.
        IF QUOTA-MANAGERS-CLIENT-QUOTA-CALLBACK IS RECONFIGURABLE
            MOVE QUOTA-MANAGERS-CLIENT-QUOTA-CALLBACK-RECONFIGURABLE-CONFIGS TO CONFIGS
        END-IF.
        RETURN CONFIGS.

    VALIDATE-RECONFIGURATION-METHOD.
        IF QUOTA-MANAGERS-CLIENT-QUOTA-CALLBACK IS RECONFIGURABLE
            CALL "VALIDATE-RECONFIGURATION" USING QUOTA-MANAGERS-CLIENT-QUOTA-CALLBACK NEWCONFIGS
        END-IF.

    RECONFIGURE-METHOD.
        IF QUOTA-MANAGERS-CLIENT-QUOTA-CALLBACK IS RECONFIGURABLE
            CALL "MAYBE-RECONFIGURE" USING QUOTA-MANAGERS-CLIENT-QUOTA-CALLBACK OLDCONFIG NEWCONFIGS
        END-IF.

DYNAMIC-LISTENER-CONFIG SECTION.
    RECONFIGURABLE-CONFIGS.
        MOVE DYNAMIC-LISTENER-CONFIG-RECONFIGURABLE-CONFIGS TO RECONFIGURABLE-CONFIGS.

    VALIDATE-RECONFIGURATION-METHOD.
        CALL "VALIDATE-LISTENER-RECONFIGURATION" USING NEWCONFIG OLDCONFIG.

    RECONFIGURE-METHOD.
        CALL "REMOVE-LISTENERS" USING LISTENERSREMOVED.
        CALL "ADD-LISTENERS" USING LISTENERSADDED.

DYNAMIC-PRODUCER-STATE-MANAGER-CONFIG SECTION.
    VALIDATE-RECONFIGURATION-METHOD.
        IF NEWCONFIG-PRODUCER-ID-EXPIRATION-MS < 0
            RAISE CONFIGEXCEPTION.

    RECONFIGURE-METHOD.
        IF NEWCONFIG-PRODUCER-ID-EXPIRATION-MS NOT = OLDCONFIG-PRODUCER-ID-EXPIRATION-MS
            CALL "SET-PRODUCER-ID-EXPIRATION-MS" USING NEWCONFIG-PRODUCER-ID-EXPIRATION-MS.
        IF NEWCONFIG-TRANSACTION-VERIFICATION-ENABLED NOT = OLDCONFIG-TRANSACTION-VERIFICATION-ENABLED
            CALL "SET-TRANSACTION-VERIFICATION-ENABLED" USING NEWCONFIG-TRANSACTION-VERIFICATION-ENABLED.

DYNAMIC-REMOTE-LOG-CONFIG SECTION.
    RECONFIGURABLE-CONFIGS.
        MOVE DYNAMIC-REMOTE-LOG-CONFIG-RECONFIGURABLE-CONFIGS TO RECONFIGURABLE-CONFIGS.

    VALIDATE-RECONFIGURATION-METHOD.
        PERFORM VARYING CONFIG IN NEWCONFIG-VALUES
            EVALUATE CONFIG
                WHEN REMOTE-LOG-INDEX-FILE-CACHE-TOTAL-SIZE-BYTES-PROP
                     REMOTE-LOG-MANAGER-COPY-MAX-BYTES-PER-SECOND-PROP
                     REMOTE-LOG-MANAGER-FETCH-MAX-BYTES-PER-SECOND-PROP