IDENTIFICATION DIVISION.
PROGRAM-ID. KAFKA-BROKER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL INTRINSIC FUNCTIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-METRICS-TYPE-NAME PIC X(11) VALUE 'KafkaServer'.
01 WS-MIN-INCREMENTAL-FETCH-SESSION-EVICTION-MS PIC 9(9) VALUE 120000.
01 WS-NUM-FETCH-SESSION-CACHE-SHARDS PIC 9(1) VALUE 8.

01 WS-AUTHORIZER PIC X(1).
01 WS-BROKER-STATE PIC X(1).
01 WS-CLUSTER-ID PIC X(1).
01 WS-CONFIG PIC X(1).
01 WS-DATA-PLANE-REQUEST-HANDLER-POOL PIC X(1).
01 WS-DATA-PLANE-REQUEST-PROCESSOR PIC X(1).
01 WS-KAFKA-SCHEDULER PIC X(1).
01 WS-KAFKA-YAMMER-METRICS PIC X(1).
01 WS-LOG-DIR-FAILURE-CHANNEL PIC X(1).
01 WS-LOG-MANAGER PIC X(1).
01 WS-REMOTE-LOG-MANAGER-OPT PIC X(1).
01 WS-METRICS PIC X(1).
01 WS-QUOTA-MANAGERS PIC X(1).
01 WS-REPLICA-MANAGER PIC X(1).
01 WS-SOCKET-SERVER PIC X(1).
01 WS-METADATA-CACHE PIC X(1).
01 WS-GROUP-COORDINATOR PIC X(1).
01 WS-BROKER-TOPIC-STATS PIC X(1).
01 WS-CREDENTIAL-PROVIDER PIC X(1).
01 WS-CLIENT-TO-CONTROLLER-CHANNEL-MANAGER PIC X(1).
01 WS-TOKEN-CACHE PIC X(1).

PROCEDURE DIVISION.
    MAIN-PROCEDURE.
        PERFORM STARTUP-PROCEDURE.
        PERFORM AWAIT-SHUTDOWN-PROCEDURE.
        PERFORM SHUTDOWN-PROCEDURE.
        STOP RUN.

    STARTUP-PROCEDURE.
        DISPLAY 'Kafka Server started'.

    AWAIT-SHUTDOWN-PROCEDURE.
        CONTINUE.

    SHUTDOWN-PROCEDURE.
        CONTINUE.

    NOTIFY-CLUSTER-LISTENERS.
        CONTINUE.

    NOTIFY-METRICS-REPORTERS.
        CONTINUE.

    BOUNDED-PORT.
        CONTINUE.

    BROKER-SHUTDOWN.
        CONTINUE.

    IS-SHUTDOWN.
        CONTINUE.

    LINUX-IO-METRICS-COLLECTOR.
        CONTINUE.

    KAFKA-METRICS-GROUP.
        CONTINUE.

    CONTEXT-CHANGE.
        CONTINUE.

END PROGRAM KAFKA-BROKER.