IDENTIFICATION DIVISION.
PROGRAM-ID. KAFKAAPIS.
AUTHOR. COBOL PROGRAMMING EXPERT.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION DELEGATIONTOKENMANAGER.
    FUNCTION KAFKACONFIG.
    FUNCTION METADATACACHE.
    FUNCTION METRICS.
    FUNCTION REQUESTCHANNEL.
    FUNCTION REQUESTLOCAL.
    FUNCTION REPLICAQUOTA.
    FUNCTION REPLICAMANAGER.
    FUNCTION SHARECOORDINATOR.
    FUNCTION SHAREPARITIONMANAGER.
    FUNCTION TIME.
    FUNCTION TRANSACTIONCOORDINATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BROKERTOPCISTATS PIC X(256).
01 CLUSTERD PIC X(256).
01 CLIENTID PIC X(50).
01 CORRELATIONID PIC 9(10).
01 SECURITYPROTOCOL PIC X(20).
01 PRINCIPAL PIC X(100).
01 LISTENERNAME PIC X(50).
01 UNAUTHORIZEDTOPICRESPONSES PIC X(500) OCCURS 99.
01 NONEXISTINGTOPICRESPONSES PIC X(500) OCCURS 99.
01 INVALIDREQUESTRESPONSES PIC X(500) OCCURS 99.
01 AUTHORIZEDREQUESTINFO PIC X(500) OCCURS 99.
01 ERRONEOUSANDVALIDPARTITIONDATA.
    05 ERRONEOUS PIC X(500) OCCURS 99.
    05 VALIDTOPICIDPARTITIONS PIC X(500) OCCURS 99.
01 FETCHRESPONSEDATA.
    05 TOPICIDPARTITION PIC X(100).
    05 PARTITIONDATA PIC X(256).
01 AUTHORIZEDGROUPS PIC X(100) OCCURS 99.
01 AUTHORIZEDTOPICS PIC X(100) OCCURS 99.
01 UNAUTHORIZEDFORTOPICSDESCRIBEGROUPS PIC X(100) OCCURS 99.
01 UNAUTHORIZEDFORCREATETOPICS PIC X(100) OCCURS 99.
01 LEADERNODE.
    05 LEADERID PIC 9(10).
    05 LEADEREPOCH PIC 9(10).
    05 NODE PIC X(50).
01 MAXTHROTTLETIMEMS PIC 9(10).
01 RESPONSEPARTITIONDATA PIC X(500) OCCURS 99.
01 NODEENDPOINTS PIC X(50) OCCURS 99.
01 TOPICIDNAMES PIC X(100) OCCURS 99.
01 ACKNOWLEDGEMENTDATA.
    05 TOPICIDPARTITION PIC X(100).
    05 ACKNOWLEDGEMENTBATCHES PIC X(100) OCCURS 99.
01 ERRONEOUS-TOPICIDPARTITIONS PIC X(100) OCCURS 99.
01 INTERESTED PIC X(100) OCCURS 99.
01 EMPTYACKNOWLEDGEMENTS PIC X(100) OCCURS 99.
01 AUTHORIZEDTOPICSFORSHARE PIC X(100) OCCURS 99.
01 SHAREDESCRIBERESPONSE PIC X(1000).
01 SHARDFETCHCONTEXTRELEASEDRECORDSDATA PIC X(100).

PROCEDURE DIVISION.

MAIN-PROCEDURE.

    PERFORM HANDLE-PRODUCE-REQUEST.
    PERFORM HANDLE-FETCH-REQUEST.
    PERFORM HANDLE-LISTOFFSET-REQUEST.
    PERFORM HANDLE-TOPICMETADATA-REQUEST.
    PERFORM HANDLE-OFFSETCOMMIT-REQUEST.
    PERFORM HANDLE-OFFSETFETCH-REQUEST.
    PERFORM HANDLE-FINDCOORDINATOR-REQUEST.
    PERFORM HANDLE-JOINGROUP-REQUEST.
    PERFORM HANDLE-SYNCGROUP-REQUEST.
    PERFORM HANDLE-DESCRIBEGROUPS-REQUEST.
    PERFORM HANDLE-LISTGROUPS-REQUEST.
    PERFORM HANDLE-SASLHANDSHAKE-REQUEST.
    PERFORM HANDLE-APIVERSION-REQUEST.
    PERFORM HANDLE-DELETERECORDS-REQUEST.
    PERFORM HANDLE-INITPRODUCERID-REQUEST.
    PERFORM HANDLE-OFFSETFORLEADEREPOCH-REQUEST.
    PERFORM HANDLE-ADDPARTITIONSTOTXN-REQUEST.
    PERFORM HANDLE-ADDOFFSETSTOTXN-REQUEST.
    PERFORM HANDLE-ENDTXN-REQUEST.
    PERFORM HANDLE-WRITETXNMARKERS-REQUEST.
    PERFORM HANDLE-TXNOFFSETCOMMIT-REQUEST.
    PERFORM HANDLE-DESCRIBEACLS-REQUEST.
    PERFORM HANDLE-ALTERCONFIGS-REQUEST.
    PERFORM HANDLE-DESCRIBECONFIGS-REQUEST.
    PERFORM HANDLE-ALTERREPLICALOGDIRS-REQUEST.
    PERFORM HANDLE-DESCRIBELOGDIRS-REQUEST.
    PERFORM HANDLE-SASLAUTH-REQUEST.
    PERFORM HANDLE-CREATETOKEN-REQUEST.
    PERFORM HANDLE-EXPIRETOKEN-REQUEST.
    PERFORM HANDLE-RENEWTOKEN-REQUEST.
    PERFORM HANDLE-DESCRIBETOKEN-REQUEST.
    PERFORM HANDLE-DELETEGROUPS-REQUEST.
    PERFORM HANDLE-INCREMENTALALTERCONFIGS-REQUEST.
    PERFORM HANDLE-OFFSETDELETE-REQUEST.
    PERFORM HANDLE-DESCRIBECLIENTQUOTAS-REQUEST.
    PERFORM HANDLE-DESCRIBEUSERSCRAMEDEENTIALS-REQUEST.
    PERFORM HANDLE-DESCRIBECLUSTER-REQUEST.
    PERFORM HANDLE-DESCRIBEPRODUCERS-REQUEST.
    PERFORM HANDLE-DESCRIBETRANSACTIONS-REQUEST.
    PERFORM HANDLE-LISTTRANSACTIONS-REQUEST.
    PERFORM HANDLE-CONSUMERGROUPHEARTBEAT-REQUEST.
    PERFORM HANDLE-CONSUMERGROUPDESCRIBE-REQUEST.
    PERFORM HANDLE-DESRIBETOPICPARTITIONS-REQUEST.
    PERFORM HANDLE-GETTEMETRYSUBSCRIPTIONS-REQUEST.
    PERFORM HANDLE-PUSHTELEMETRY-REQUEST.
    PERFORM HANDLE-LISTCLIENTMETRICSRESOURCES-REQUEST.
    PERFORM HANDLE-SHAREGROUPHEARTBEAT-REQUEST.
    PERFORM HANDLE-SHAREGROUPDESCRIBE-REQUEST.
    PERFORM HANDLE-SHAREFETCH-REQUEST.
    PERFORM HANDLE-SHAREACKNOWLEDGE-REQUEST.
    PERFORM HANDLE-INITIALIZESHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-READSHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-WRITESHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-DELETESHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-READSHAIREGROUPSTATESUMARY-REQUEST.
    PERFORM HANDLE-DESCRIBESHAIREGROUPOFFSETS-REQUEST.
    PERFORM HANDLE-ALTERSHAIREGROUPOFFSETS-REQUEST.
    PERFORM HANDLE-DELETESHAIREGROUPOFFSETS-REQUEST.

    STOP RUN.

HANDLE-PRODUCE-REQUEST.
    PERFORM VALIDATE-PRODUCE-REQUEST.
    PERFORM APPEND-RECORDS-TO-REPLICAS.
    PERFORM SEND-PRODUCE-RESPONSE.

HANDLE-FETCH-REQUEST.
    PERFORM FETCH-DATA-FROM-REPLICAS.
    PERFORM SEND-FETCH-RESPONSE.

HANDLE-LISTOFFSET-REQUEST.
    PERFORM FETCH-OFFSETS.
    PERFORM SEND-LISTOFFSET-RESPONSE.

HANDLE-TOPICMETADATA-REQUEST.
    PERFORM GET-TOPIC-METADATA.
    PERFORM SEND-METADATA-RESPONSE.

HANDLE-OFFSETCOMMIT-REQUEST.
    PERFORM COMMIT-OFFSETS-TO-COORDINATOR.
    PERFORM SEND-OFFSETCOMMIT-RESPONSE.

HANDLE-OFFSETFETCH-REQUEST.
    PERFORM FETCH-OFFSETS-FOR-GROUP.
    PERFORM SEND-OFFSETFETCH-RESPONSE.

HANDLE-FINDCOORDINATOR-REQUEST.
    PERFORM GET-COORDINATOR.
    PERFORM SEND-FINDCOORDINATOR-RESPONSE.

HANDLE-JOINGROUP-REQUEST.
    PERFORM JOIN-GROUP.
    PERFORM SEND-JOINGROUP-RESPONSE.

HANDLE-SYNCGROUP-REQUEST.
    PERFORM SYNC-GROUP.
    PERFORM SEND-SYNCGROUP-RESPONSE.

HANDLE-DESCRIBEGROUPS-REQUEST.
    PERFORM DESCRIBE-GROUPS.
    PERFORM SEND-DESCRIBEGROUPS-RESPONSE.

HANDLE-LISTGROUPS-REQUEST.
    PERFORM LIST-GROUPS.
    PERFORM SEND-LISTGROUPS-RESPONSE.

HANDLE-SASLHANDSHAKE-REQUEST.
    PERFORM SEND-SASLHANDSHAKE-RESPONSE.

HANDLE-APIVERSION-REQUEST.
    PERFORM SEND-APIVERSION-RESPONSE.

HANDLE-DELETERECORDS-REQUEST.
    PERFORM DELETE-RECORDS.
    PERFORM SEND-DELETERECORDS-RESPONSE.

HANDLE-INITPRODUCERID-REQUEST.
    PERFORM INIT-PRODUCERID.
    PERFORM SEND-INITPRODUCERID-RESPONSE.

HANDLE-OFFSETFORLEADEREPOCH-REQUEST.
    PERFORM GET-LAST-OFFSET-FOR-LEADER-EPOCH.
    PERFORM SEND-OFFSETFORLEADEREPOCH-RESPONSE.

HANDLE-ADDPARTITIONSTOTXN-REQUEST.
    PERFORM ADD-PARTITIONS-TO-TRANSACTION.
    PERFORM SEND-ADDPARTITIONSTOTXN-RESPONSE.

HANDLE-ADDOFFSETSTOTXN-REQUEST.
    PERFORM ADD-OFFSETS-TO-TRANSACTION.
    PERFORM SEND-ADDOFFSETSTOTXN-RESPONSE.

HANDLE-ENDTXN-REQUEST.
    PERFORM END-TRANSACTION.
    PERFORM SEND-ENDTXN-RESPONSE.

HANDLE-WRITETXNMARKERS-REQUEST.
    PERFORM WRITE-TXN-MARKERS.
    PERFORM SEND-WRITETXNMARKERS-RESPONSE.

HANDLE-TXNOFFSETCOMMIT-REQUEST.
    PERFORM COMMIT-TXN-OFFSETS.
    PERFORM SEND-TXNOFFSETCOMMIT-RESPONSE.

HANDLE-DESCRIBEACLS-REQUEST.
    PERFORM HANDLE-DESCRIBE-ACLS.

HANDLE-ALTERCONFIGS-REQUEST.
    PERFORM PREPROCESS-CONFIG-CHANGES.
    PERFORM FORWARD-ALTER-CONFIG-REQUEST.
    PERFORM SEND-ALTERCONFIGS-RESPONSE.

HANDLE-DESCRIBECONFIGS-REQUEST.
    PERFORM PROCESS-DESCRIBECONFIGS-REQUEST.
    PERFORM SEND-DESCRIBECONFIGS-RESPONSE.

HANDLE-ALTERREPLICALOGDIRS-REQUEST.
    PERFORM ALTER-REPLICA-LOG-DIRS.
    PERFORM SEND-ALTERREPLICALOGDIRS-RESPONSE.

HANDLE-DESCRIBELOGDIRS-REQUEST.
    PERFORM DESCRIBE-LOG-DIRS.
    PERFORM SEND-DESCRIBELOGDIRS-RESPONSE.

HANDLE-SASLAUTH-REQUEST.
    PERFORM SEND-SASLAUTH-RESPONSE.

HANDLE-CREATETOKEN-REQUEST.
    PERFORM FORWARD-CREATE-TOKEN-REQUEST.

HANDLE-EXPIRETOKEN-REQUEST.
    PERFORM FORWARD-EXPIRE-TOKEN-REQUEST.

HANDLE-RENEWTOKEN-REQUEST.
    PERFORM FORWARD-RENEW-TOKEN-REQUEST.

HANDLE-DESCRIBETOKEN-REQUEST.
    PERFORM SEND-DESCRIBETOKEN-RESPONSE.

HANDLE-DELETEGROUPS-REQUEST.
    PERFORM DELETE-GROUPS.
    PERFORM SEND-DELETEGROUPS-RESPONSE.

HANDLE-INCREMENTALALTERCONFIGS-REQUEST.
    PERFORM PREPROCESS-CONFIG-CHANGES.
    PERFORM FORWARD-INCREMENTALALTERCONFIG-REQUEST.
    PERFORM SEND-INCREMENTALALTERCONFIGS-RESPONSE.

HANDLE-OFFSETDELETE-REQUEST.
    PERFORM DELETE-OFFSETS.
    PERFORM SEND-OFFSETDELETE-RESPONSE.

HANDLE-DESCRIBECLIENTQUOTAS-REQUEST.
    PERFORM DESCRIBE-CLIENT-QUOTAS.
    PERFORM SEND-DESCRIBECLIENTQUOTAS-RESPONSE.

HANDLE-DESCRIBEUSERSCRAMEDEENTIALS-REQUEST.
    PERFORM DESCRIBE-USER-SCRAM-CREDENTIALS.
    PERFORM SEND-DESCRIBEUSERSCRAMEDEENTIALS-RESPONSE.

HANDLE-DESCRIBECLUSTER-REQUEST.
    PERFORM DESCRIBE-CLUSTER.
    PERFORM SEND-DESCRIBECLUSTER-RESPONSE.

HANDLE-DESCRIBEPRODUCERS-REQUEST.
    PERFORM DESCRIBE-PRODUCERS.
    PERFORM SEND-DESCRIBEPRODUCERS-RESPONSE.

HANDLE-DESCRIBETRANSACTIONS-REQUEST.
    PERFORM DESCRIBE-TRANSACTIONS.
    PERFORM SEND-DESCRIBETRANSACTIONS-RESPONSE.

HANDLE-LISTTRANSACTIONS-REQUEST.
    PERFORM LIST-TRANSACTIONS.
    PERFORM SEND-LISTTRANSACTIONS-RESPONSE.

HANDLE-CONSUMERGROUPHEARTBEAT-REQUEST.
    PERFORM HANDLE-CONSUMER-GROUP-HEARTBEAT.
    PERFORM SEND-CONSUMERGROUPHEARTBEAT-RESPONSE.

HANDLE-CONSUMERGROUPDESCRIBE-REQUEST.
    PERFORM HANDLE-CONSUMER-GROUP-DESCRIBE.
    PERFORM SEND-CONSUMERGROUPDESCRIBE-RESPONSE.

HANDLE-DESRIBETOPICPARTITIONS-REQUEST.
    PERFORM HANDLE-DESCRIBE-TOPIC-PARTITIONS.
    PERFORM SEND-DESRIBETOPICPARTITIONS-RESPONSE.

HANDLE-GETTEMETRYSUBSCRIPTIONS-REQUEST.
    PERFORM HANDLE-GET-TELEMETRY-SUBSCRIPTIONS.
    PERFORM SEND-GETTEMETRYSUBSCRIPTIONS-RESPONSE.

HANDLE-PUSHTELEMETRY-REQUEST.
    PERFORM HANDLE-PUSH-TELEMETRY.
    PERFORM SEND-PUSHTELEMETRY-RESPONSE.

HANDLE-LISTCLIENTMETRICSRESOURCES-REQUEST.
    PERFORM HANDLE-LIST-CLIENT-METRICS-RESOURCES.
    PERFORM SEND-LISTCLIENTMETRICSRESOURCES-RESPONSE.

HANDLE-SHAREGROUPHEARTBEAT-REQUEST.
    PERFORM HANDLE-SHARE-GROUP-HEARTBEAT.
    PERFORM SEND-SHAREGROUPHEARTBEAT-RESPONSE.

HANDLE-SHAREGROUPDESCRIBE-REQUEST.
    PERFORM HANDLE-SHARE-GROUP-DESCRIBE.
    PERFORM SEND-SHAREGROUPDESCRIBE-RESPONSE.

HANDLE-SHAREFETCH-REQUEST.
    PERFORM HANDLE-SHARE-FETCH.
    PERFORM SEND-SHAREFETCH-RESPONSE.

HANDLE-SHAREACKNOWLEDGE-REQUEST.
    PERFORM HANDLE-SHARE-ACKNOWLEDGE.
    PERFORM SEND-SHAREACKNOWLEDGE-RESPONSE.

HANDLE-INITIALIZESHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-INITIALIZE-SHARE-GROUP-STATE.
    PERFORM SEND-INITIALIZESHAIREGROUPSTATE-RESPONSE.

HANDLE-READSHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-READ-SHARE-GROUP-STATE.
    PERFORM SEND-READSHAIREGROUPSTATE-RESPONSE.

HANDLE-WRITESHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-WRITE-SHARE-GROUP-STATE.
    PERFORM SEND-WRITESHAIREGROUPSTATE-RESPONSE.

HANDLE-DELETESHAIREGROUPSTATE-REQUEST.
    PERFORM HANDLE-DELETE-SHARE-GROUP-STATE.
    PERFORM SEND-DELETESHAIREGROUPSTATE-RESPONSE.

HANDLE-READSHAIREGROUPSTATESUMARY-REQUEST.
    PERFORM HANDLE-READ-SHARE-GROUP-STATE-SUMMARY.
    PERFORM SEND-READSHAIREGROUPSTATESUMARY-RESPONSE.

HANDLE-DESCRIBESHAIREGROUPOFFSETS-REQUEST.
    PERFORM HANDLE-DESCRIBE-SHARE-GROUP-OFFSETS.
    PERFORM SEND-DESCRIBESHAIREGROUPOFFSETS-RESPONSE.

HANDLE-ALTERSHAIREGROUPOFFSETS-