IDENTIFICATION DIVISION.
PROGRAM-ID. QUOTA-FACTORY.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY 'KAFKA-COMMON.CPY'.
    COPY 'QUOTA-CONFIG.CPY'.
    COPY 'CLIENT-QUOTA-CALLBACK.CPY'.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 UNBOUNDED-QUOTA.
   05 FILLER PIC X(1).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM INSTANTIATE.
    PERFORM SHUTDOWN.
    STOP RUN.

INSTANTIATE.
    MOVE FUNCTION CONFIGUREDNEW(
        QUOTA-CALLBACK-CLASS-CONFIG, 
        CLIENT-QUOTA-CALLBACK)
    TO CLIENT-QUOTA-CALLBACK.

    MOVE NEW QUOTA-MANAGERS(
        NEW CLIENT-QUOTA-MANAGER(
            CLIENT-CONFIG(QUOTA-CONFIG),
            METRICS, 
            FETCH-QUOTA, 
            TIME, 
            THREAD-NAME-PREFIX, 
            QUOTA-CALLBACK),
        NEW CLIENT-QUOTA-MANAGER(
            CLIENT-CONFIG(QUOTA-CONFIG),
            METRICS,
            PRODUCE-QUOTA,
            TIME,
            THREAD-NAME-PREFIX,
            QUOTA-CALLBACK),
        NEW CLIENT-REQUEST-QUOTA-MANAGER(
            CLIENT-CONFIG(QUOTA-CONFIG),
            METRICS,
            TIME,
            THREAD-NAME-PREFIX,
            QUOTA-CALLBACK),
        NEW CONTROLLER-MUTATION-QUOTA-MANAGER(
            CLIENT-CONTROLLER-MUTATION-CONFIG(QUOTA-CONFIG),
            METRICS,
            TIME,
            THREAD-NAME-PREFIX,
            QUOTA-CALLBACK),
        NEW REPLICATION-QUOTA-MANAGER(
            REPLICATION-CONFIG(QUOTA-CONFIG),
            METRICS,
            LEADER-REPLICATION,
            TIME),
        NEW REPLICATION-QUOTA-MANAGER(
            REPLICATION-CONFIG(QUOTA-CONFIG),
            METRICS,
            FOLLOWER-REPLICATION,
            TIME),
        NEW REPLICATION-QUOTA-MANAGER(
            ALTER-LOG-DIRS-REPLICATION-CONFIG(QUOTA-CONFIG),
            METRICS,
            ALTER-LOG-DIRS-REPLICATION,
            TIME),
        QUOTA-CALLBACK)
    TO QUOTA-MANAGERS.

SHUTDOWN.
    CALL SHUTDOWN ON QUOTA-MANAGERS.

CLIENT-CONFIG.
    MOVE NEW CLIENT-QUOTA-MANAGER-CONFIG(
        QUOTA-CONFIG-NUM-QUOTA-SAMPLES,
        QUOTA-CONFIG-QUOTA-WINDOW-SIZE-SECONDS)
    TO RESULT.

CLIENT-CONTROLLER-MUTATION-CONFIG.
    MOVE NEW CLIENT-QUOTA-MANAGER-CONFIG(
        QUOTA-CONFIG-NUM-CONTROLLER-QUOTA-SAMPLES,
        QUOTA-CONFIG-CONTROLLER-QUOTA-WINDOW-SIZE-SECONDS)
    TO RESULT.

REPLICATION-CONFIG.
    MOVE NEW REPLICATION-QUOTA-MANAGER-CONFIG(
        QUOTA-CONFIG-NUM-REPLICATION-QUOTA-SAMPLES,
        QUOTA-CONFIG-REPLICATION-QUOTA-WINDOW-SIZE-SECONDS)
    TO RESULT.

ALTER-LOG-DIRS-REPLICATION-CONFIG.
    MOVE NEW REPLICATION-QUOTA-MANAGER-CONFIG(
        QUOTA-CONFIG-NUM-ALTER-LOG-DIRS-REPLICATION-QUOTA-SAMPLES,
        QUOTA-CONFIG-ALTER-LOG-DIRS-REPLICATION-QUOTA-WINDOW-SIZE-SECONDS)
    TO RESULT.