IDENTIFICATION DIVISION.
PROGRAM-ID. REPLICA-FETCHER-MANAGER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    COPY "KAFKA-CONFIG".
    COPY "REPLICA-MANAGER".
    COPY "METRICS".
    COPY "TIME".
    COPY "METADATA-VERSION".
    COPY "BROKER-END-POINT".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 THREAD-NAME-PREFIX PIC X(16) VALUE SPACES.
01 THREAD-NAME PIC X(32) VALUE SPACES.
01 LOG-CONTEXT.
    05 LOG-PREFIX PIC X(64) VALUE SPACES.
01 ENDPOINT.
    05 SENDER-ID PIC 9(4) VALUE ZEROS.
    05 SENDER-NAME PIC X(16) VALUE SPACES.
01 FETCH-SESSION-HANDLER.
    05 SOURCE-BROKER-ID PIC 9(4) VALUE ZEROS.
01 LEADER.
    05 LOGPREFIX PIC X(64) VALUE SPACES.
    05 ENDPOINT-PTR POINTER VALUE NULL.
    05 FETCH-SESSION-HANDLER-PTR POINTER VALUE NULL.
    05 CONFIG-PTR POINTER VALUE NULL.
    05 REPLICA-MANAGER-PTR POINTER VALUE NULL.
    05 QUOTA-MANAGER-PTR POINTER VALUE NULL.
    05 METADATA-VERSION-SUPPLIER-PTR POINTER VALUE NULL.
    05 BROKER-EPOCH-SUPPLIER-PTR POINTER VALUE NULL.
01 REPLICA-FETCHER-THREAD.
    05 THREAD-NAME PIC X(32) VALUE SPACES.
    05 LEADER-PTR POINTER VALUE NULL.
    05 CONFIG-PTR POINTER VALUE NULL.
    05 FAILED-PARTITIONS-PTR POINTER VALUE NULL.
    05 REPLICA-MANAGER-PTR POINTER VALUE NULL.
    05 QUOTA-MANAGER-PTR POINTER VALUE NULL.
    05 LOGPREFIX PIC X(64) VALUE SPACES.
    05 METADATA-VERSION-SUPPLIER-PTR POINTER VALUE NULL.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM CREATE-FETCHER-THREAD.
    PERFORM SHUTDOWN.
    STOP RUN.

CREATE-FETCHER-THREAD.
    MOVE "ReplicaFetcherThread-" TO THREAD-NAME.
    MOVE CORRESPONDING ITEMS FROM KAFKA-CONFIG TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM REPLICA-MANAGER TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM QUOTA-MANAGER TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM METADATA-VERSION-SUPPLIER TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM BROKER-EPOCH-SUPPLIER TO REPLICA-FETCHER-THREAD.
    PERFORM CREATE-ENDPOINT.
    PERFORM CREATE-FETCH-SESSION-HANDLER.
    PERFORM CREATE-LEADER.
    PERFORM CREATE-REPLICA-FETCHER-THREAD.

CREATE-ENDPOINT.
    MOVE CORRESPONDING ITEMS FROM BROKER-END-POINT TO ENDPOINT.
    MOVE CORRESPONDING ITEMS FROM KAFKA-CONFIG TO ENDPOINT.
    MOVE CORRESPONDING ITEMS FROM METRICS TO ENDPOINT.
    MOVE CORRESPONDING ITEMS FROM TIME TO ENDPOINT.
    MOVE CORRESPONDING ITEMS FROM LOG-CONTEXT TO ENDPOINT.
    PERFORM CREATE-BROKER-BLOCKING-SENDER.

CREATE-BROKER-BLOCKING-SENDER.
    *> Implementation of BrokerBlockingSender

CREATE-FETCH-SESSION-HANDLER.
    MOVE CORRESPONDING ITEMS FROM BROKER-END-POINT TO FETCH-SESSION-HANDLER.

CREATE-LEADER.
    MOVE CORRESPONDING ITEMS FROM LOG-CONTEXT TO LEADER.
    MOVE ENDPOINT-PTR TO LEADER.
    MOVE FETCH-SESSION-HANDLER-PTR TO LEADER.
    MOVE CORRESPONDING ITEMS FROM KAFKA-CONFIG TO LEADER.
    MOVE CORRESPONDING ITEMS FROM REPLICA-MANAGER TO LEADER.
    MOVE CORRESPONDING ITEMS FROM QUOTA-MANAGER TO LEADER.
    MOVE CORRESPONDING ITEMS FROM METADATA-VERSION-SUPPLIER TO LEADER.
    MOVE CORRESPONDING ITEMS FROM BROKER-EPOCH-SUPPLIER TO LEADER.

CREATE-REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM THREAD-NAME TO REPLICA-FETCHER-THREAD.
    MOVE LEADER-PTR TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM KAFKA-CONFIG TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM FAILED-PARTITIONS TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM REPLICA-MANAGER TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM QUOTA-MANAGER TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM LOG-CONTEXT TO REPLICA-FETCHER-THREAD.
    MOVE CORRESPONDING ITEMS FROM METADATA-VERSION-SUPPLIER TO REPLICA-FETCHER-THREAD.

SHUTDOWN.
    DISPLAY "shutting down".
    PERFORM CLOSE-ALL-FETCHERS.
    DISPLAY "shutdown completed".

CLOSE-ALL-FETCHERS.
    *> Implementation of closeAllFetchers()