IDENTIFICATION DIVISION.
PROGRAM-ID. REQUEST-HANDLER-HELPER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL INTRINSIC FUNCTIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-THROTTLE-CALLBACK.
   05 WS-START-THROTTLING-FUNC PROCEDURE-POINTER.
   05 WS-END-THROTTLING-FUNC PROCEDURE-POINTER.

PROCEDURE DIVISION.

THROTTLE-PROCEDURE.
    MOVE REQUEST-CHANNEL-START-THROTTLING TO WS-START-THROTTLING-FUNC
    MOVE REQUEST-CHANNEL-END-THROTTLING TO WS-END-THROTTLING-FUNC
    CALL QUOTA-MANAGER-THROTTLE USING REQUEST, WS-THROTTLE-CALLBACK, THROTTLE-TIME-MS.

HANDLE-ERROR-PROCEDURE.
    IF CLUSTER-AUTHORIZATION-EXCEPTION OR NOT REQUEST-HEADER-API-KEY-CLUSTER-ACTION
        PERFORM SEND-ERROR-RESPONSE-MAYBE-THROTTLE
    ELSE
        PERFORM SEND-ERROR-RESPONSE-EXEMPT-THROTTLE.

SEND-ERROR-OR-CLOSE-CONNECTION.
    MOVE REQUEST-BODY-GET-ERROR-RESPONSE TO RESPONSE
    IF RESPONSE = NULL
        CALL REQUEST-CHANNEL-CLOSE-CONNECTION USING REQUEST, REQUEST-BODY-ERROR-COUNTS
    ELSE
        CALL REQUEST-CHANNEL-SEND-RESPONSE USING REQUEST, RESPONSE, NULL.

SEND-FORWARDED-RESPONSE.
    MOVE RESPONSE-THROTTLE-TIME-MS TO CONTROLLER-THROTTLE-TIME-MS
    MOVE REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS TO REQUEST-THROTTLE-TIME-MS
    MOVE MAX(CONTROLLER-THROTTLE-TIME-MS, REQUEST-THROTTLE-TIME-MS) TO APPLIED-THROTTLE-TIME-MS
    PERFORM THROTTLE-PROCEDURE USING QUOTA-REQUEST, REQUEST, APPLIED-THROTTLE-TIME-MS
    CALL RESPONSE-MAYBE-SET-THROTTLE-TIME-MS USING APPLIED-THROTTLE-TIME-MS
    CALL REQUEST-CHANNEL-SEND-RESPONSE USING REQUEST, RESPONSE, NULL.

SEND-MAYBE-THROTTLE.
    MOVE REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS TO THROTTLE-TIME-MS
    IF NOT REQUEST-IS-FORWARDED
        PERFORM THROTTLE-PROCEDURE USING QUOTA-REQUEST, REQUEST, THROTTLE-TIME-MS
    CALL RESPONSE-MAYBE-SET-THROTTLE-TIME-MS USING THROTTLE-TIME-MS
    CALL REQUEST-CHANNEL-SEND-RESPONSE USING REQUEST, RESPONSE, NULL.

SEND-RESPONSE-MAYBE-THROTTLE.
    MOVE REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS TO THROTTLE-TIME-MS
    IF NOT REQUEST-IS-FORWARDED
        PERFORM THROTTLE-PROCEDURE USING QUOTA-REQUEST, REQUEST, THROTTLE-TIME-MS
    CALL REQUEST-CHANNEL-SEND-RESPONSE USING REQUEST, CREATE-RESPONSE(THROTTLE-TIME-MS), NULL.

SEND-ERROR-RESPONSE-MAYBE-THROTTLE.
    MOVE REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS TO THROTTLE-TIME-MS
    IF CLUSTER-AUTHORIZATION-EXCEPTION OR NOT REQUEST-IS-FORWARDED
        PERFORM THROTTLE-PROCEDURE USING QUOTA-REQUEST, REQUEST, THROTTLE-TIME-MS
    PERFORM SEND-ERROR-OR-CLOSE-CONNECTION USING REQUEST, ERROR, THROTTLE-TIME-MS.

REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS.
    MOVE QUOTA-REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS USING REQUEST, TIME-MILLISECONDS TO THROTTLE-TIME-MS
    MOVE THROTTLE-TIME-MS TO REQUEST-API-THROTTLE-TIME-MS
    MOVE THROTTLE-TIME-MS TO RETURN-CODE.

SEND-RESPONSE-MAYBE-THROTTLE-WITH-CONTROLLER-QUOTA.
    MOVE TIME-MILLISECONDS TO TIME-MS
    MOVE CONTROLLER-MUTATION-QUOTA-THROTTLE-TIME TO CONTROLLER-THROTTLE-TIME-MS
    MOVE QUOTA-REQUEST-MAY-BE-RECORD-AND-GET-THROTTLE-TIME-MS USING REQUEST, TIME-MS TO REQUEST-THROTTLE-TIME-MS
    MOVE MAX(CONTROLLER-THROTTLE-TIME-MS, REQUEST-THROTTLE-TIME-MS) TO MAX-THROTTLE-TIME-MS
    IF MAX-THROTTLE-TIME-MS > 0 AND NOT REQUEST-IS-FORWARDED
        MOVE MAX-THROTTLE-TIME-MS TO REQUEST-API-THROTTLE-TIME-MS
        IF CONTROLLER-THROTTLE-TIME-MS > REQUEST-THROTTLE-TIME-MS
            PERFORM THROTTLE-PROCEDURE USING QUOTA-CONTROLLER-MUTATION, REQUEST, CONTROLLER-THROTTLE-TIME-MS
        ELSE
            PERFORM THROTTLE-PROCEDURE USING QUOTA-REQUEST, REQUEST, REQUEST-THROTTLE-TIME-MS
    CALL RESPONSE-MAYBE-SET-THROTTLE-TIME-MS USING MAX-THROTTLE-TIME-MS
    CALL REQUEST-CHANNEL-SEND-RESPONSE USING REQUEST, RESPONSE, NULL.

SEND-RESPONSE-EXEMPT-THROTTLE.
    CALL QUOTA-REQUEST-MAY-BE-RECORD-EXEMPT USING REQUEST
    CALL REQUEST-CHANNEL-SEND-RESPONSE USING REQUEST, RESPONSE, ONCOMPLETE.

SEND-ERROR-RESPONSE-EXEMPT-THROTTLE.
    CALL QUOTA-REQUEST-MAY-BE-RECORD-EXEMPT USING REQUEST
    PERFORM SEND-ERROR-OR-CLOSE-CONNECTION USING REQUEST, ERROR, 0.

SEND-NO-OP-RESPONSE-EXEMPT-THROTTLE.
    CALL QUOTA-REQUEST-MAY-BE-RECORD-EXEMPT USING REQUEST
    CALL REQUEST-CHANNEL-SEND-NO-OP-RESPONSE USING REQUEST.

END PROGRAM REQUEST-HANDLER-HELPER.