IDENTIFICATION DIVISION.
PROGRAM-ID. SCRAM-PUBLISHER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
COPY "KAFKA-CONFIG".
COPY "CREDENTIAL-PROVIDER".
COPY "FAULT-HANDLER".

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-LOGIDENT PIC X(256) VALUE "[SCRAM-PUBLISHER ] ".
01 WS-NODE-TYPE PIC X(256).
01 WS-DELTA-NAME PIC X(256).

PROCEDURE DIVISION.
INIT-SECTION.
    MOVE FUNCTION CONCATENATE("[", WS-NODE-TYPE, " id=", CONF-NODE-ID, "] ") TO WS-LOGIDENT.

ON-METADATA-UPDATE.
    PERFORM PROCESS-SCRAM-DELTA
    PERFORM HANDLE-FAULT
    .

PROCESS-SCRAM-DELTA.
    MOVE FUNCTION CONCATENATE("MetadataDelta up to ", FUNCTION TRIM(FUNCTION CONVERT(NEWIMAGE-HIGHEST-OFFSET-AND-EPOCH-OFFSET, TO ALPHANUMERIC))) TO WS-DELTA-NAME
    PERFORM VARYING MECHANISM THROUGH SCRAMDELTA-CHANGES
        PERFORM VARYING USERNAME THROUGH USERCHANGES
            IF CHANGE-IS-PRESENT
                CALL "UPDATE-CREDENTIAL" USING MECHANISM, USERNAME, CHANGE-GET-CREDENTIAL(MECHANISM)
            ELSE
                CALL "REMOVE-CREDENTIALS" USING MECHANISM, USERNAME
            END-IF
        END-PERFORM
    END-PERFORM
    .

HANDLE-FAULT.
    CALL "HANDLE-FAULT" USING "Uncaught exception while publishing SCRAM changes from " WS-DELTA-NAME, EXCEPTION-OBJECT
    .

END PROGRAM SCRAM-PUBLISHER.