IDENTIFICATION DIVISION.
PROGRAM-ID. SHARE-PARTITION-MANAGER.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION TIME.
    FUNCTION REPLICAMANAGER.
    FUNCTION SHARESESSIONCACHE.
    FUNCTION GROUPCONFIGMANAGER.
    FUNCTION SHAREPARTITIONKEY.
    FUNCTION SHAREACKNOWLEDGERESPONSEDATAPARTITIONDATA.
    FUNCTION TOPICIDPARTITION.
    FUNCTION SHAREFETCHREQUEST.
    FUNCTION SHAREREQUESTMETADATA.
    FUNCTION CACHEDSHARE-PARTITION.
    FUNCTION SHARESESSIONKEY.
    FUNCTION SHAREPARTITION.
    FUNCTION SHAREFETCH.
    FUNCTION SHARESESSIONCONTEXT.
    FUNCTION FINALCONTEXT.
    FUNCTION DELAYEDSHAREFETCHKEY.
    FUNCTION DELAYEDSHAREFETCHGROUPKEY.
    FUNCTION DELAYEDSHAREFETCHPARTITIONKEY.
    FUNCTION PARTITIONROTATEMETADATA.
    FUNCTION PARTITIONROTATESTRATEGY.
    FUNCTION SHAREPARTITIONLISTENER.
    FUNCTION SHAREPARTITIONMANAGEREXCEPTION.
    FUNCTION SHAREPARTITIONKEY.
    FUNCTION SHAREACKNOWLEDGEMENTBATCH.
    FUNCTION SHAREGROUPTRICS.
    FUNCTION BROKERTOPICSTATS.
    FUNCTION ERRORS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PARTITION-CACHE-MAP PIC X(32768) USAGE IS DATA-POINTER.
01 REPLICA-MANAGER PIC X(32768) USAGE IS DATA-POINTER.
01 TIME PIC X(32768) USAGE IS DATA-POINTER.
01 CACHE PIC X(32768) USAGE IS DATA-POINTER.
01 GROUP-CONFIG-MANAGER PIC X(32768) USAGE IS DATA-POINTER.
01 DEFAULT-RECORD-LOCK-DURATION-MS PIC 9(9) COMP.
01 TIMER PIC X(32768) USAGE IS DATA-POINTER.
01 MAX-DELIVERY-COUNT PIC 9(9) COMP.
01 MAX-IN-FLIGHT-MESSAGES PIC 9(9) COMP.
01 PERSISTER PIC X(32768) USAGE IS DATA-POINTER.
01 SHARE-GROUP-METRICS PIC X(32768) USAGE IS DATA-POINTER.
01 BROKER-TOPIC-STATS PIC X(32768) USAGE IS DATA-POINTER.
01 MAX-FETCH-RECORDS PIC 9(9) COMP.

PROCEDURE DIVISION.

    IDENTIFICATION SECTION.

    *> The constructors
    SHARE-PARTITION-MANAGER-CONSTRUCTOR.
        PERFORM SHARE-PARTITION-MANAGER-CONSTRUCTOR-1.
        PERFORM SHARE-PARTITION-MANAGER-CONSTRUCTOR-2.
        PERFORM SHARE-PARTITION-MANAGER-CONSTRUCTOR-3.

    SHARE-PARTITION-MANAGER-CONSTRUCTOR-1.
        MOVE REPLICAMANAGER TO REPLICA-MANAGER.
        MOVE TIME TO TIME.
        MOVE SHARESESSIONCACHE TO CACHE.
        MOVE GROUPCONFIGMANAGER TO GROUP-CONFIG-MANAGER.
        MOVE DEFAULT-RECORD-LOCK-DURATION-MS TO DEFAULT-RECORD-LOCK-DURATION-MS.
        MOVE MAX-DELIVERY-COUNT TO MAX-DELIVERY-COUNT.
        MOVE MAX-IN-FLIGHT-MESSAGES TO MAX-IN-FLIGHT-MESSAGES.
        MOVE MAX-FETCH-RECORDS TO MAX-FETCH-RECORDS.
        MOVE PERSISTER TO PERSISTER.
        MOVE SHAREGROUPTRICS TO SHARE-GROUP-METRICS.
        MOVE BROKERTOPICSTATS TO BROKER-TOPIC-STATS.

    SHARE-PARTITION-MANAGER-CONSTRUCTOR-2.
        MOVE REPLICAMANAGER TO REPLICA-MANAGER.
        MOVE TIME TO TIME.
        MOVE SHARESESSIONCACHE TO CACHE.
        MOVE PARTITION-CACHE-MAP TO PARTITION-CACHE-MAP.
        MOVE DEFAULT-RECORD-LOCK-DURATION-MS TO DEFAULT-RECORD-LOCK-DURATION-MS.
        MOVE MAX-DELIVERY-COUNT TO MAX-DELIVERY-COUNT.
        MOVE MAX-IN-FLIGHT-MESSAGES TO MAX-IN-FLIGHT-MESSAGES.
        MOVE MAX-FETCH-RECORDS TO MAX-FETCH-RECORDS.
        MOVE PERSISTER TO PERSISTER.
        MOVE GROUPCONFIGMANAGER TO GROUP-CONFIG-MANAGER.
        MOVE SHAREGROUPTRICS TO SHARE-GROUP-METRICS.
        MOVE BROKERTOPICSTATS TO BROKER-TOPIC-STATS.

    SHARE-PARTITION-MANAGER-CONSTRUCTOR-3.
        MOVE REPLICAMANAGER TO REPLICA-MANAGER.
        MOVE TIME TO TIME.
        MOVE SHARESESSIONCACHE TO CACHE.
        MOVE PARTITION-CACHE-MAP TO PARTITION-CACHE-MAP.
        MOVE DEFAULT-RECORD-LOCK-DURATION-MS TO DEFAULT-RECORD-LOCK-DURATION-MS.
        MOVE TIMER TO TIMER.
        MOVE MAX-DELIVERY-COUNT TO MAX-DELIVERY-COUNT.
        MOVE MAX-IN-FLIGHT-MESSAGES TO MAX-IN-FLIGHT-MESSAGES.
        MOVE MAX-FETCH-RECORDS TO MAX-FETCH-RECORDS.
        MOVE PERSISTER TO PERSISTER.
        MOVE GROUPCONFIGMANAGER TO GROUP-CONFIG-MANAGER.
        MOVE SHAREGROUPTRICS TO SHARE-GROUP-METRICS.
        MOVE BROKERTOPICSTATS TO BROKER-TOPIC-STATS.

    *> The fetch messages method
    FETCH-MESSAGES.
        MOVE GROUPID TO GROUPID.
        MOVE MEMBERID TO MEMBERID.
        MOVE FETCHPARAMS TO FETCHPARAMS.
        MOVE SESSIONEPOCH TO SESSIONEPOCH.
        MOVE BATCHSIZE TO BATCHSIZE.
        MOVE PARTITIONMAXBYTES TO PARTITIONMAXBYTES.
        PERFORM FETCH-MESSAGES-INTERNAL.
        RETURN FETCHRESULT.

    FETCH-MESSAGES-INTERNAL.
        PERFORM PARTITIONROTATESTRATEGY-ROTATE.
        PERFORM SHAREFETCH-PROCESS.

    *> The acknowledge method  
    ACKNOWLEDGE.
        MOVE MEMBERID TO MEMBERID.
        MOVE GROUPID TO GROUPID.
        MOVE ACKNOWLEDGE-TOPICS TO ACKNOWLEDGE-TOPICS.
        PERFORM ACKNOWLEDGE-INTERNAL.
        RETURN ACKNOWLEDGERESULT.

    ACKNOWLEDGE-INTERNAL.
        PERFORM ACKNOWLEDGE-PARTITIONS.
        PERFORM ACKNOWLEDGE-UPDATE-METRICS.

    *> The release session method
    RELEASE-SESSION.
        MOVE GROUPID TO GROUPID.
        MOVE MEMBERID TO MEMBERID.
        PERFORM RELEASE-SESSION-INTERNAL.
        RETURN RELEASESESSIONRESULT.

    RELEASE-SESSION-INTERNAL.
        PERFORM REMOVE-SHARE-SESSION.
        PERFORM RELEASE-ACQUIRED-RECORDS.

    *> The new context method
    NEW-CONTEXT.
        MOVE GROUPID TO GROUPID.
        MOVE SHAREFETCHDATA TO SHAREFETCHDATA.
        MOVE TOFORGET TO TOFORGET.
        MOVE REQMETADATA TO REQMETADATA.
        MOVE ISACKNOWLEDGEDATAPRESENT TO ISACKNOWLEDGEDATAPRESENT.
        PERFORM CREATE-NEW-CONTEXT.
        RETURN NEWCONTEXT.

    CREATE-NEW-CONTEXT.
        PERFORM FILTER-SHAREFETCHDATA-MAXBYTES.
        PERFORM CREATE-SHARE-SESSION-CONTEXT.

    *> The acknowledge session update method
    ACKNOWLEDGE-SESSION-UPDATE.
        MOVE GROUPID TO GROUPID.
        MOVE REQMETADATA TO REQMETADATA.
        PERFORM ACKNOWLEDGE-SESSION-UPDATE-INTERNAL.

    ACKNOWLEDGE-SESSION-UPDATE-INTERNAL.
        PERFORM VALIDATE-SHARE-SESSION-EPOCH.
        PERFORM UPDATE-SHARE-SESSION-EPOCH-AND-LASTUSED.

    *> The cached topic-partitions in share session method
    CACHED-TOPICID-PARTITIONS-IN-SHARE-SESSION.
        MOVE GROUPID TO GROUPID.
        MOVE MEMBERID TO MEMBERID.
        PERFORM GET-CACHED-TOPICID-PARTITIONS.
        RETURN CACHEDTOPICIDPARTITIONS.

    GET-CACHED-TOPICID-PARTITIONS.
        PERFORM GET-SHARE-SESSION.
        IF SHARE-SESSION IS NULL
            RETURN EMPTY-LIST
        ELSE
            PERFORM EXTRACT-TOPICID-PARTITIONS-FROM-SHARE-SESSION.

    *> The close method
    CLOSE.
        PERFORM TIMER-CLOSE.
        PERFORM SHARE-GROUP-METRICS-CLOSE.

    *> Utility methods
    SHARE-SESSION-KEY.
        MOVE GROUPID TO GROUPID.
        MOVE MEMBERID TO MEMBERID.
        RETURN SHARESESSONKEY.

    GET-OR-CREATE-SHARE-PARTITION.
        MOVE SHAREPARTITIONKEY TO SHAREPARTITIONKEY.
        PERFORM GET-LEADER-EPOCH.
        PERFORM CREATE-SHARE-PARTITION.
        RETURN SHAREPARTITION.

    GET-LEADER-EPOCH.
        PERFORM REPLICAMANAGER-GET-LEADER-EPOCH.

    CREATE-SHARE-PARTITION.
        MOVE GROUPID TO GROUPID.
        MOVE TOPICIDPARTITION TO TOPICIDPARTITION.
        MOVE LEADEREPOCH TO LEADEREPOCH.
        MOVE MAX-IN-FLIGHT-MESSAGES TO MAX-IN-FLIGHT-MESSAGES.
        MOVE MAX-DELIVERY-COUNT TO MAX-DELIVERY-COUNT. 
        MOVE DEFAULT-RECORD-LOCK-DURATION-MS TO DEFAULT-RECORD-LOCK-DURATION-MS.
        MOVE TIMER TO TIMER.
        MOVE TIME TO TIME.
        MOVE PERSISTER TO PERSISTER.
        MOVE REPLICAMANAGER TO REPLICAMANAGER.
        MOVE GROUP-CONFIG-MANAGER TO GROUP-CONFIG-MANAGER.
        MOVE SHARE-PARTITION-LISTENER TO SHARE-PARTITION-LISTENER.
        CREATE SHAREPARTITION.
        RETURN SHAREPARTITION.

    REPLICAMANAGER-GET-LEADER-EPOCH.
        MOVE TOPICPARTITION TO TOPICPARTITION.
        CALL REPLICAMANAGER USING TOPICPARTITION RETURNING LEADEREPOCH.

    SHARE-PARTITION-LISTENER.
        MOVE SHAREPARTITIONKEY TO SHAREPARTITIONKEY.
        MOVE REPLICAMANAGER TO REPLICAMANAGER.
        MOVE PARTITION-CACHE-MAP TO PARTITION-CACHE-MAP.
        CREATE SHAREPARTITIONLISTENER.

    REMOVE-SHARE-PARTITION-FROM-CACHE.
        MOVE SHAREPARTITIONKEY TO SHAREPARTITIONKEY.
        MOVE REPLICAMANAGER TO REPLICAMANAGER.
        MOVE PARTITION-CACHE-MAP TO PARTITION-CACHE-MAP.
        PERFORM REMOVE-SHARE-PARTITION.

    REMOVE-SHARE-PARTITION.
        MOVE SHAREPARTITIONKEY TO SHAREPARTITIONKEY.
        PERFORM REMOVE-SHARE-PARTITION-FROM-MAP.
        PERFORM REPLICAMANAGER-REMOVE-LISTENER.

    REMOVE-SHARE-PARTITION-FROM-MAP.
        MOVE SHAREPARTITIONKEY TO SHAREPARTITIONKEY.
        MOVE PARTITION-CACHE-MAP TO PARTITION-CACHE-MAP.
        REMOVE SHAREPARTITION FROM PARTITION-CACHE-MAP.
        MOVE SHAREPARTITION TO SHAREPARTITION.
        IF SHAREPARTITION IS NOT NULL
            PERFORM SHAREPARTITION-MARK-FENCED.

    REPLICAMANAGER-REMOVE-LISTENER.
        MOVE TOPICPARTITION TO TOPICPARTITION.
        MOVE SHARE-PARTITION-LISTENER TO SHARE-PARTITION-LISTENER.
        CALL REPLICAMANAGER USING TOPICPARTITION, SHARE-PARTITION-LISTENER.

    SHAREPARTITION-MARK-FENCED.
        MOVE SHAREPARTITION TO SHAREPARTITION.
        CALL SHAREPARTITION USING "MARK-FENCED".

    FILTER-SHAREFETCHDATA-MAXBYTES.
        MOVE SHAREFETCHDATA TO SHAREFETCHDATA.
        CREATE NEW-SHAREFETCHDATA.
        PERFORM FILTER-SHAREFETCHDATA.
        MOVE NEW-SHAREFETCHDATA TO SHAREFETCHDATA-WITHBYTES.

    FILTER-SHAREFETCHDATA.
        FOREACH TOPICIDPARTITION, SHAREPARTITIONDATA IN SHAREFETCHDATA
            IF SHAREPARTITIONDATA-MAXBYTES > 0
                ADD TOPICIDPARTITION, SHAREPARTITIONDATA TO NEW-SHAREFETCHDATA
        END-FOREACH.

    CREATE-SHARE-SESSION-CONTEXT.
        MOVE GROUPID TO GROUPID.
        MOVE REQMETADATA TO REQMETADATA.
        MOVE SHAREFETCHDATA-WITHBYTES TO SHAREFETCHDATA-WITHBYTES.
        PERFORM HANDLE-SPECIAL-EPOCHS.
        PERFORM CREATE-NEW-SHARE-SESSION.
        MOVE NEWCONTEXT TO NEWCONTEXT.

    HANDLE-SPECIAL-EPOCHS.
        MOVE REQMETADATA TO REQMETADATA.
        IF REQMETADATA-ISFULL = TRUE
            IF REQMETADATA-EPOCH = SHAREREQUESTMETADATA-FINAL-EPOCH
                PERFORM HANDLE-FINAL-EPOCH
            ELSE
                PERFORM HANDLE-INITIAL-EPOCH
        END-IF.

    HANDLE-FINAL-EPOCH.
        IF SHAREFETCHDATA-WITHBYTES IS NOT EMPTY
            RAISE ERRORS-INVALID-REQUEST-EXCEPTION.
        PERFORM GET-SHARE-SESSION.
        IF SHARE-SESSION IS NULL
            RAISE ERRORS-SHARESESSION-NOT-FOUND-EXCEPTION.
        MOVE FINALCONTEXT TO NEWCONTEXT.

    HANDLE-INITIAL-EPOCH.
        IF ISACKNOWLEDGEDATAPRESENT = TRUE
            RAISE ERRORS-INVALID-REQUEST-EXCEPTION.
        PERFORM GET-SHARE-SESSION.
        IF SHARE-SESSION IS NOT NULL
            PERFORM REMOVE-SHARE-SESSION.
        PERFORM CREATE-NEW-SHARE-SESSION.
        MOVE SHARESESIONCONTEXT TO NEWCONTEXT.

    GET-SHARE-SESSION.
        MOVE SHARESESIONKEY TO SHARESESIONKEY.
        MOVE CACHE TO CACHE.
        CALL CACHE USING SHARESESIONKEY RETURNING SHARE-SESSION.

    REMOVE-SHARE-SESSION.
        MOVE SHARESESIONKEY TO SHARESESIONKEY.
        MOVE CACHE TO CACHE.
        CALL CACHE USING SHARESESIONKEY RETURNING REMOVED-SESSION.
        IF REMOVED-SESSION IS NOT NULL
            LOG "Removed share session with key {SHARESESIONKEY}".

    CREATE-NEW-SHARE-SESSION.
        MOVE GROUPID TO GROUPID.
        MOVE REQMETADATA-MEMBERID TO MEMBERID.
        MOVE TIME-CURRENT TO CREATEDTIME.
        MOVE CACHEDSHARE-PARTITIONS TO CACHEDSHARE-PARTITIONS.
        CALL CACHE USING GROUPID, MEMBERID, CREATEDTIME, CACHEDSHARE-PARTITIONS RETURNING SHARESESIONKEY.
        IF SHARESESIONKEY IS NULL
            RAISE ERRORS-SHARESESSION-NOT-FOUND-EXCEPTION.
        MOVE SHARESESIONCONTEXT TO NEWCONTEXT.

    UPDATE-SHARE-SESSION-EPOCH-AND-LASTUSED.
        MOVE SHARESESIONKEY TO SHARESESIONKEY.
        MOVE CACHE TO CACHE.
        CALL CACHE USING SHARESESIONKEY RETURNING SHARE-SESSION.
        IF SHARE-SESSION IS NULL
            RAISE ERRORS-SHARESESSION