IDENTIFICATION DIVISION.
PROGRAM-ID. TERSE-FAILURE.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE PIC X(256) VALUE SPACES.

PROCEDURE DIVISION.
    MOVE MESSAGE TO WS-MESSAGE.
    STOP RUN.
    GOBACK.